sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
/*!
   \file    gd32a7xx_syscfg.h
   \brief   definitions for the SYSCFG

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_SYSCFG_H
#define GD32A7XX_SYSCFG_H

#include "gd32a7xx.h"

/* SYSCFG definitions */
#define SYSCFG                                       SYSCFG_BASE                        /*!< SYSCFG base address */

/* registers definitions */
#define SYSCFG_PMCFG                                 REG32(SYSCFG + 0x00000004U)        /*!< peripheral mode configuration register */
#define SYSCFG_EXTISS0                               REG32(SYSCFG + 0x00000008U)        /*!< EXTI sources selection register 0 */
#define SYSCFG_EXTISS1                               REG32(SYSCFG + 0x0000000CU)        /*!< EXTI sources selection register 1 */
#define SYSCFG_EXTISS2                               REG32(SYSCFG + 0x00000010U)        /*!< EXTI sources selection register 2 */
#define SYSCFG_EXTISS3                               REG32(SYSCFG + 0x00000014U)        /*!< EXTI sources selection register 3 */
#define SYSCFG_STAT                                  REG32(SYSCFG + 0x00000020U)        /*!< system status register */
#define SYSCFG_CFG                                   REG32(SYSCFG + 0x00000024U)        /*!< system configuration register */
#define SYSCFG_TIMERBKINSEL                          REG32(SYSCFG + 0x0000002CU)        /*!< TIMER break input select register */
#define SYSCFG_CPU0ICAC                              REG32(SYSCFG + 0x00000030U)        /*!< CPU0 ICACHE error status register */
#define SYSCFG_CPU0DCAC                              REG32(SYSCFG + 0x00000034U)        /*!< CPU0 DCACHE error status register */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define SYSCFG_CPU1ICAC                              REG32(SYSCFG + 0x00000038U)        /*!< CPU1 ICACHE error status register */
#define SYSCFG_CPU1DCAC                              REG32(SYSCFG + 0x0000003CU)        /*!< CPU1 DCACHE error status register */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
#define SYSCFG_CPUCTL                                REG32(SYSCFG + 0x00000050U)        /*!< CPU control register */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define SYSCFG_CPUSTAT                               REG32(SYSCFG + 0x00000054U)        /*!< CPU platform status register */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define SYSCFG_CPU0CS                                REG32(SYSCFG + 0x00000058U)        /*!< CPU0 interrupt status and control register */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define SYSCFG_CPU1CS                                REG32(SYSCFG + 0x0000005CU)        /*!< CPU1 interrupt status and control register */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define SYSCFG_SRAMCFG                               REG32(SYSCFG + 0x00000068U)        /*!< SRAM configuration register */
#define SYSCFG_RMCFG                                 REG32(SYSCFG + 0x0000006CU)        /*!< recovery mode configuration register */
#define SYSCFG_HSMSTAT                               REG32(SYSCFG + 0x00000070U)        /*!< HSM sub system status register */
#define SYSCFG_TIMER0CFG0                            REG32(SYSCFG + 0x00000100U)        /*!< TIMER0 configuration register */
#define SYSCFG_TIMER0CFG1                            REG32(SYSCFG + 0x00000104U)        /*!< TIMER0 configuration register */
#define SYSCFG_TIMER0CFG2                            REG32(SYSCFG + 0x00000108U)        /*!< TIMER0 configuration register */
#define SYSCFG_TIMER1CFG0                            REG32(SYSCFG + 0x0000010CU)        /*!< TIMER1 configuration register */
#define SYSCFG_TIMER1CFG1                            REG32(SYSCFG + 0x00000110U)        /*!< TIMER1 configuration register */
#define SYSCFG_TIMER1CFG2                            REG32(SYSCFG + 0x00000114U)        /*!< TIMER1 configuration register */
#define SYSCFG_TIMER2CFG0                            REG32(SYSCFG + 0x00000118U)        /*!< TIMER2 configuration register */
#define SYSCFG_TIMER2CFG1                            REG32(SYSCFG + 0x0000011CU)        /*!< TIMER2 configuration register */
#define SYSCFG_TIMER2CFG2                            REG32(SYSCFG + 0x00000120U)        /*!< TIMER2 configuration register */
#define SYSCFG_TIMER7CFG0                            REG32(SYSCFG + 0x00000124U)        /*!< TIMER7 configuration register */
#define SYSCFG_TIMER7CFG1                            REG32(SYSCFG + 0x00000128U)        /*!< TIMER7 configuration register */
#define SYSCFG_TIMER7CFG2                            REG32(SYSCFG + 0x0000012CU)        /*!< TIMER7 configuration register */
#define SYSCFG_TIMER19CFG0                           REG32(SYSCFG + 0x00000130U)        /*!< TIMER19 configuration register */
#define SYSCFG_TIMER19CFG1                           REG32(SYSCFG + 0x00000134U)        /*!< TIMER19 configuration register */
#define SYSCFG_TIMER19CFG2                           REG32(SYSCFG + 0x00000138U)        /*!< TIMER19 configuration register */
#define SYSCFG_TIMER20CFG0                           REG32(SYSCFG + 0x0000013CU)        /*!< TIMER20 configuration register */
#define SYSCFG_TIMER20CFG1                           REG32(SYSCFG + 0x00000140U)        /*!< TIMER20 configuration register */
#define SYSCFG_TIMER20CFG2                           REG32(SYSCFG + 0x00000144U)        /*!< TIMER20 configuration register */
#define SYSCFG_TIMER60CFG0                           REG32(SYSCFG + 0x00000148U)        /*!< TIMER60 configuration register */
#define SYSCFG_TIMER60CFG1                           REG32(SYSCFG + 0x0000014CU)        /*!< TIMER60 configuration register */
#define SYSCFG_TIMER60CFG2                           REG32(SYSCFG + 0x00000150U)        /*!< TIMER60 configuration register */
#define SYSCFG_TIMER61CFG0                           REG32(SYSCFG + 0x00000154U)        /*!< TIMER61 configuration register */
#define SYSCFG_TIMER61CFG1                           REG32(SYSCFG + 0x00000158U)        /*!< TIMER61 configuration register */
#define SYSCFG_TIMER61CFG2                           REG32(SYSCFG + 0x0000015CU)        /*!< TIMER61 configuration register */
#define SYSCFG_TIMER62CFG0                           REG32(SYSCFG + 0x00000160U)        /*!< TIMER62 configuration register */
#define SYSCFG_TIMER62CFG1                           REG32(SYSCFG + 0x00000164U)        /*!< TIMER62 configuration register */
#define SYSCFG_TIMER62CFG2                           REG32(SYSCFG + 0x00000168U)        /*!< TIMER62 configuration register */
#define SYSCFG_TIMER63CFG0                           REG32(SYSCFG + 0x0000016CU)        /*!< TIMER63 configuration register */
#define SYSCFG_TIMER63CFG1                           REG32(SYSCFG + 0x00000170U)        /*!< TIMER63 configuration register */
#define SYSCFG_TIMER63CFG2                           REG32(SYSCFG + 0x00000174U)        /*!< TIMER63 configuration register */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define SYSCFG_CPID                                  REG32(SYSCFG + 0x00000220U)        /*!< core processor ID register */
#define SYSCFG_CPNUM                                 REG32(SYSCFG + 0x00000224U)        /*!< core porcessor number register */
#define SYSCFG_CPCFGINF0                             REG32(SYSCFG + 0x0000022CU)        /*!< core processor configuration information register 0 */
#define SYSCFG_CPCFGINF1                             REG32(SYSCFG + 0x00000234U)        /*!< core processor configuration information register 1 */
#define SYSCFG_CPCFGINF2                             REG32(SYSCFG + 0x00000238U)        /*!< core processor configuration information register 2 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define SYSCFG_CP0ID                                 REG32(SYSCFG + 0x00000240U)        /*!< core processor 0 ID register */
#define SYSCFG_CP0NUM                                REG32(SYSCFG + 0x00000244U)        /*!< core processor 0 number register */
#define SYSCFG_CP0CFGINF0                            REG32(SYSCFG + 0x0000024CU)        /*!< core processor 0 configuration information register 0 */
#define SYSCFG_CP0CFGINF1                            REG32(SYSCFG + 0x00000254U)        /*!< core processor 0 configuration information register 1 */
#define SYSCFG_CP0CFGINF2                            REG32(SYSCFG + 0x00000258U)        /*!< core processor 0 configuration information register 2 */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define SYSCFG_CP1ID                                 REG32(SYSCFG + 0x00000260U)        /*!< core processor 1 ID register */
#define SYSCFG_CP1NUM                                REG32(SYSCFG + 0x00000264U)        /*!< core processor 1 number register */
#define SYSCFG_CP1CFGINF0                            REG32(SYSCFG + 0x0000026CU)        /*!< core processor 1 configuration information register 0 */
#define SYSCFG_CP1CFGINF1                            REG32(SYSCFG + 0x00000274U)        /*!< core processor 1 configuration information register 1 */
#define SYSCFG_CP1CFGINF2                            REG32(SYSCFG + 0x00000278U)        /*!< core processor 1 configuration information register 2 */
#define SYSCFG_IRCP0INTSTAT0                         REG32(SYSCFG + 0x00000300U)        /*!< interrupt router core processor 0 interrupt status register 0 */
#define SYSCFG_IRCP0INTSTAT1                         REG32(SYSCFG + 0x00000308U)        /*!< interrupt router core processor 0 interrupt status register 1 */
#define SYSCFG_IRCP0INTSTAT2                         REG32(SYSCFG + 0x00000310U)        /*!< interrupt router core processor 0 interrupt status register 2 */
#define SYSCFG_IRCP0INTSTAT3                         REG32(SYSCFG + 0x00000318U)        /*!< interrupt router core processor 0 interrupt status register 3 */
#define SYSCFG_IRCP1INTSTAT0                         REG32(SYSCFG + 0x00000320U)        /*!< interrupt router core processor 1 interrupt status register 0 */
#define SYSCFG_IRCP1INTSTAT1                         REG32(SYSCFG + 0x00000328U)        /*!< interrupt router core processor 1 interrupt status register 1 */
#define SYSCFG_IRCP1INTSTAT2                         REG32(SYSCFG + 0x00000330U)        /*!< interrupt router core processor 1 interrupt status register 2 */
#define SYSCFG_IRCP1INTSTAT3                         REG32(SYSCFG + 0x00000338U)        /*!< interrupt router core processor 1 interrupt status register 3 */
#define SYSCFG_IRCP0INT0                             REG32(SYSCFG + 0x00000304U)        /*!< interrupt router core processor 0 interrupt generation register 0 */
#define SYSCFG_IRCP0INT1                             REG32(SYSCFG + 0x0000030CU)        /*!< interrupt router core processor 0 interrupt generation register 1 */
#define SYSCFG_IRCP0INT2                             REG32(SYSCFG + 0x00000314U)        /*!< interrupt router core processor 0 interrupt generation register 2 */
#define SYSCFG_IRCP0INT3                             REG32(SYSCFG + 0x0000031CU)        /*!< interrupt router core processor 0 interrupt generation register 3 */
#define SYSCFG_IRCP1INT0                             REG32(SYSCFG + 0x00000324U)        /*!< interrupt router core processor 1 interrupt generation register 0 */
#define SYSCFG_IRCP1INT1                             REG32(SYSCFG + 0x0000032CU)        /*!< interrupt router core processor 1 interrupt generation register 1 */
#define SYSCFG_IRCP1INT2                             REG32(SYSCFG + 0x00000334U)        /*!< interrupt router core processor 1 interrupt generation register 2 */
#define SYSCFG_IRCP1INT3                             REG32(SYSCFG + 0x0000033CU)        /*!< interrupt router core processor 1 interrupt generation register 3 */
#define SYSCFG_IRCPUCTL                              REG32(SYSCFG + 0x00000340U)        /*!< interrupt router core processor control register */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
#define SYSCFG_MEMAEXCTL                             REG32(SYSCFG + 0x00000350U)        /*!< memory access execution control register */
#define SYSCFG_BM1EDCEN                              REG32(SYSCFG + 0x00000360U)        /*!< bus matrix1 interconnect error detection enable register */
#define SYSCFG_BM2EDCEN                              REG32(SYSCFG + 0x00000364U)        /*!< bus matrix2 interconnect error detection enable register */
#define SYSCFG_BUSCHKCFG                             REG32(SYSCFG + 0x00000368U)        /*!< bus check configuration register */
#define SYSCFG_TMRFCS                                REG32(SYSCFG + 0x00000370U)        /*!< TMR fault status and control register */

