sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
/* bits definitions */
/* SYSCFG_PMCFG */
#define SYSCFG_PMCFG_I2C0FMPEN                       BIT(0)                             /*!< I2C0 fast mode plus enable */
#define SYSCFG_PMCFG_I2C1FMPEN                       BIT(1)                             /*!< I2C1 fast mode plus enable */

/* SYSCFG_EXTISS0 */
#define SYSCFG_EXTISS0_EXTI0_SS                      BITS(0,3)                          /*!< EXTI 0 sources selection */
#define SYSCFG_EXTISS0_EXTI1_SS                      BITS(4,7)                          /*!< EXTI 1 sources selection */
#define SYSCFG_EXTISS0_EXTI2_SS                      BITS(8,11)                         /*!< EXTI 2 sources selection */
#define SYSCFG_EXTISS0_EXTI3_SS                      BITS(12,15)                        /*!< EXTI 3 sources selection */

/* SYSCFG_EXTISS1 */
#define SYSCFG_EXTISS1_EXTI4_SS                      BITS(0,3)                          /*!< EXTI 4 sources selection */
#define SYSCFG_EXTISS1_EXTI5_SS                      BITS(4,7)                          /*!< EXTI 5 sources selection */
#define SYSCFG_EXTISS1_EXTI6_SS                      BITS(8,11)                         /*!< EXTI 6 sources selection */
#define SYSCFG_EXTISS1_EXTI7_SS                      BITS(12,15)                        /*!< EXTI 7 sources selection */

/* SYSCFG_EXTISS2 */
#define SYSCFG_EXTISS2_EXTI8_SS                      BITS(0,3)                          /*!< EXTI 8 sources selection */
#define SYSCFG_EXTISS2_EXTI9_SS                      BITS(4,7)                          /*!< EXTI 9 sources selection */
#define SYSCFG_EXTISS2_EXTI10_SS                     BITS(8,11)                         /*!< EXTI 10 sources selection */
#define SYSCFG_EXTISS2_EXTI11_SS                     BITS(12,15)                        /*!< EXTI 11 sources selection */

/* SYSCFG_EXTISS3 */
#define SYSCFG_EXTISS3_EXTI12_SS                     BITS(0,3)                          /*!< EXTI 12 sources selection */
#define SYSCFG_EXTISS3_EXTI13_SS                     BITS(4,7)                          /*!< EXTI 13 sources selection */
#define SYSCFG_EXTISS3_EXTI14_SS                     BITS(8,11)                         /*!< EXTI 14 sources selection */
#define SYSCFG_EXTISS3_EXTI15_SS                     BITS(12,15)                        /*!< EXTI 15 sources selection */

/* SYSCFG_STAT */
#define SYSCFG_STAT_CKMNMIIF                         BIT(3)                             /*!< HXTAL clock moniotor NMI interrupt flag */
#define SYSCFG_STAT_NMIPINIF                         BIT(4)                             /*!< NMI interrupt flag from EXTI pin */
#define SYSCFG_STAT_FMUNMIIF                         BIT(5)                             /*!< NMI interrupt flag from FMU */

/* SYSCFG_CFG */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define SYSCFG_CFG_CM7_1_TXEVEN                      BIT(0)                             /*!< enable bit of EVENTOUT from CM7_1 */
#define SYSCFG_CFG_CKMNMIIE1                         BIT(3)                             /*!< enable bit of HXTAL clock moniotor NMI interrupt flag connection to CPU1 NMI interrupt */
#define SYSCFG_CFG_NMIPINIE1                         BIT(4)                             /*!< enable bit of NMI interrupt flag from EXTI pin connection to CPU1 NMI interrupt */
#define SYSCFG_CFG_FMUNMIIE1                         BIT(5)                             /*!< enable bit of NMI interrupt flag from FMU connection to CPU1 NMI interrupt */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
#define SYSCFG_CFG_CM7_0_TXEVEN                      BIT(16)                            /*!< enable bit of EVENTOUT from CM7_0 */
#define SYSCFG_CFG_CKMNMIIE0                         BIT(19)                            /*!< enable bit of HXTAL clock moniotor NMI interrupt flag connection to CPU0 NMI interrupt */
#define SYSCFG_CFG_NMIPINIE0                         BIT(20)                            /*!< enable bit of NMI interrupt flag from EXTI pin connection to CPU0 NMI interrupt */
#define SYSCFG_CFG_FMUNMIIE0                         BIT(21)                            /*!< enable bit of NMI interrupt flag from FMU connection to CPU0 NMI interrupt */
#define SYSCFG_CFG_CM23_TXEVEN                       BIT(24)                            /*!< enable bit of EVENTOUT from CM23(HSM) */

/* SYSCFG_TIMERBKINSEL */
#define SYSCFG_TIMERBKINSEL_TIMER64_BRKIN3_SEL       BIT(0)                             /*!< TIMER64 break input 3 selection */
#define SYSCFG_TIMERBKINSEL_TIMER64_BRKIN2_SEL       BIT(1)                             /*!< TIMER64 break input 2 selection */
#define SYSCFG_TIMERBKINSEL_TIMER64_BRKIN1_SEL       BIT(2)                             /*!< TIMER64 break input 1 selection */
#define SYSCFG_TIMERBKINSEL_TIMER64_BRKIN0_SEL       BIT(3)                             /*!< TIMER64 break input 0 selection */
#define SYSCFG_TIMERBKINSEL_TIMER63_BRKIN3_SEL       BIT(4)                             /*!< TIMER63 break input 3 selection */
#define SYSCFG_TIMERBKINSEL_TIMER63_BRKIN2_SEL       BIT(5)                             /*!< TIMER63 break input 2 selection */
#define SYSCFG_TIMERBKINSEL_TIMER63_BRKIN1_SEL       BIT(6)                             /*!< TIMER63 break input 1 selection */
#define SYSCFG_TIMERBKINSEL_TIMER63_BRKIN0_SEL       BIT(7)                             /*!< TIMER63 break input 0 selection */
#define SYSCFG_TIMERBKINSEL_TIMER62_BRKIN3_SEL       BIT(8)                             /*!< TIMER62 break input 3 selection */
#define SYSCFG_TIMERBKINSEL_TIMER62_BRKIN2_SEL       BIT(9)                             /*!< TIMER62 break input 2 selection */
#define SYSCFG_TIMERBKINSEL_TIMER62_BRKIN1_SEL       BIT(10)                            /*!< TIMER62 break input 1 selection */
#define SYSCFG_TIMERBKINSEL_TIMER62_BRKIN0_SEL       BIT(11)                            /*!< TIMER62 break input 0 selection */
#define SYSCFG_TIMERBKINSEL_TIMER61_BRKIN3_SEL       BIT(12)                            /*!< TIMER61 break input 3 selection */
#define SYSCFG_TIMERBKINSEL_TIMER61_BRKIN2_SEL       BIT(13)                            /*!< TIMER61 break input 2 selection */
#define SYSCFG_TIMERBKINSEL_TIMER61_BRKIN1_SEL       BIT(14)                            /*!< TIMER61 break input 1 selection */
#define SYSCFG_TIMERBKINSEL_TIMER61_BRKIN0_SEL       BIT(15)                            /*!< TIMER61 break input 0 selection */
#define SYSCFG_TIMERBKINSEL_TIMER21_BRKIN3_SEL       BIT(16)                            /*!< TIMER21 break input 3 selection */
#define SYSCFG_TIMERBKINSEL_TIMER21_BRKIN2_SEL       BIT(17)                            /*!< TIMER21 break input 2 selection */
#define SYSCFG_TIMERBKINSEL_TIMER21_BRKIN1_SEL       BIT(18)                            /*!< TIMER21 break input 1 selection */
#define SYSCFG_TIMERBKINSEL_TIMER21_BRKIN0_SEL       BIT(19)                            /*!< TIMER21 break input 0 selection */
#define SYSCFG_TIMERBKINSEL_TIMER20_BRKIN3_SEL       BIT(20)                            /*!< TIMER20 break input 3 selection */
#define SYSCFG_TIMERBKINSEL_TIMER20_BRKIN2_SEL       BIT(21)                            /*!< TIMER20 break input 2 selection */
#define SYSCFG_TIMERBKINSEL_TIMER20_BRKIN1_SEL       BIT(22)                            /*!< TIMER20 break input 1 selection */
#define SYSCFG_TIMERBKINSEL_TIMER20_BRKIN0_SEL       BIT(23)                            /*!< TIMER20 break input 0 selection */
#define SYSCFG_TIMERBKINSEL_TIMER8_BRKIN3_SEL        BIT(24)                            /*!< TIMER8 break input 3 selection */
#define SYSCFG_TIMERBKINSEL_TIMER8_BRKIN2_SEL        BIT(25)                            /*!< TIMER8 break input 2 selection */
#define SYSCFG_TIMERBKINSEL_TIMER8_BRKIN1_SEL        BIT(26)                            /*!< TIMER8 break input 1 selection */
#define SYSCFG_TIMERBKINSEL_TIMER8_BRKIN0_SEL        BIT(27)                            /*!< TIMER8 break input 0 selection */
#define SYSCFG_TIMERBKINSEL_TIMER1_BRKIN3_SEL        BIT(28)                            /*!< TIMER1 break input 3 selection */
#define SYSCFG_TIMERBKINSEL_TIMER1_BRKIN2_SEL        BIT(29)                            /*!< TIMER1 break input 2 selection */
#define SYSCFG_TIMERBKINSEL_TIMER1_BRKIN1_SEL        BIT(30)                            /*!< TIMER1 break input 1 selection */
#define SYSCFG_TIMERBKINSEL_TIMER1_BRKIN0_SEL        BIT(31)                            /*!< TIMER1 break input 0 selection */

