sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
/* SYSCFG_CPU0ICAC */
#define SYSCFG_CPU0ICAC_CPU0_ICERR                   BITS(6,27)                         /*!< CPU0 ICACHE error bank information */
#define SYSCFG_CPU0ICAC_CPU0_ICDET                   BITS(28,31)                        /*!< CPU0 ICACHE error detection information */

/* SYSCFG_CPU0DCAC */
#define SYSCFG_CPU0DCAC_CPU0_DCERR                   BITS(6,27)                         /*!< CPU0 DCACHE error bank information */
#define SYSCFG_CPU0DCAC_CPU0_DCDET                   BITS(28,31)                        /*!< CPU0 DCACHE error detection information */

#if defined (GD32A72XX) || defined (GD32A74XX)
/* SYSCFG_CPU1ICAC */
#define SYSCFG_CPU1ICAC_CPU1_ICERR                   BITS(6,27)                         /*!< CPU1 ICACHE error bank information */
#define SYSCFG_CPU1ICAC_CPU1_ICDET                   BITS(28,31)                        /*!< CPU1 ICACHE error detection information */

/* SYSCFG_CPU1DCAC */
#define SYSCFG_CPU1DCAC_CPU1_DCERR                   BITS(6,27)                         /*!< CPU1 DCACHE error bank information */
#define SYSCFG_CPU1DCAC_CPU1_DCDET                   BITS(28,31)                        /*!< CPU1 DCACHE error detection information */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

#if defined (GD32A72XX) || defined (GD32A74XX)
/* SYSCFG_CPUCTL */
#define SYSCFG_CPUCTL_CPU1_HOLD                      BIT(3)                             /*!< CPU1 hold bit */
#define SYSCFG_CPUCTL_CPU1_AHBSPRI                   BIT(11)                            /*!< CPU1 AHB slave priority bit */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
#define SYSCFG_CPUCTL_CPU0_HOLD                      BIT(19)                            /*!< CPU0 hold bit */
#define SYSCFG_CPUCTL_CPU0_AHBSPRI                   BIT(27)                            /*!< CPU0 AHB slave priority bit */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* SYSCFG_CPUSTAT */
#define SYSCFG_CPUSTAT_CPUSTAT                       BITS(0,1)                          /*!< CPU information for the chip */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* SYSCFG_CPU0CS */
#define SYSCFG_CPU0CS_WAS                            BIT(5)                             /*!< CPU0 write abort on AHB slave */
#define SYSCFG_CPU0CS_WASOVF                         BIT(6)                             /*!< CPU0 write abort on AHB slave overrun flag */
#define SYSCFG_CPU0CS_FIOPIF                         BIT(10)                            /*!< CPU0 FPU invalid operation interrupt status flag */
#define SYSCFG_CPU0CS_FDZIF                          BIT(11)                            /*!< CPU0 FPU divide-by-zero interrupt status flag */
#define SYSCFG_CPU0CS_FUFIF                          BIT(12)                            /*!< CPU0 FPU underflow interrupt status flag */
#define SYSCFG_CPU0CS_FOVFIF                         BIT(13)                            /*!< CPU0 FPU overflow interrupt status flag */
#define SYSCFG_CPU0CS_FIDIF                          BIT(14)                            /*!< CPU0 FPU input denormal interrupt status flag */
#define SYSCFG_CPU0CS_FIXIF                          BIT(15)                            /*!< CPU0 FPU inexact operation interrupt status flag */
#define SYSCFG_CPU0CS_WAIE                           BIT(21)                            /*!< CPU0 TCM write abort interrupt enable */
#define SYSCFG_CPU0CS_FIOPIE                         BIT(26)                            /*!< CPU0 FPU invalid operation interrupt enable */
#define SYSCFG_CPU0CS_FDZIE                          BIT(27)                            /*!< CPU0 FPU divide-by-zero interrupt enable */
#define SYSCFG_CPU0CS_FUFIE                          BIT(28)                            /*!< CPU0 FPU underflow interrupt enable */
#define SYSCFG_CPU0CS_FOVFIE                         BIT(29)                            /*!< CPU0 FPU overflow interrupt enable */
#define SYSCFG_CPU0CS_FIDIE                          BIT(30)                            /*!< CPU0 FPU input denormal interrupt enable */
#define SYSCFG_CPU0CS_FIXIE                          BIT(31)                            /*!< CPU0 FPU inexact operation interrupt enable */

#if defined (GD32A72XX) || defined (GD32A74XX)
/* SYSCFG_CPU1CS */
#define SYSCFG_CPU1CS_WAS                            BIT(5)                             /*!< CPU1 write abort on AHB slave */
#define SYSCFG_CPU1CS_WASOVF                         BIT(6)                             /*!< CPU1 write abort on AHB slave overrun flag */
#define SYSCFG_CPU1CS_FIOPIF                         BIT(10)                            /*!< CPU1 FPU invalid operation interrupt status flag */
#define SYSCFG_CPU1CS_FDZIF                          BIT(11)                            /*!< CPU1 FPU divide-by-zero interrupt status flag */
#define SYSCFG_CPU1CS_FUFIF                          BIT(12)                            /*!< CPU1 FPU underflow interrupt status flag */
#define SYSCFG_CPU1CS_FOVFIF                         BIT(13)                            /*!< CPU1 FPU overflow interrupt status flag */
#define SYSCFG_CPU1CS_FIDIF                          BIT(14)                            /*!< CPU1 FPU input denormal interrupt status flag */
#define SYSCFG_CPU1CS_FIXIF                          BIT(15)                            /*!< CPU1 FPU inexact operation interrupt status flag */
#define SYSCFG_CPU1CS_WAIE                           BIT(21)                            /*!< CPU1 TCM write abort interrupt enable */
#define SYSCFG_CPU1CS_FIOPIE                         BIT(26)                            /*!< CPU1 FPU invalid operation interrupt enable */
#define SYSCFG_CPU1CS_FDZIE                          BIT(27)                            /*!< CPU1 FPU divide-by-zero interrupt enable */
#define SYSCFG_CPU1CS_FUFIE                          BIT(28)                            /*!< CPU1 FPU underflow interrupt enable */
#define SYSCFG_CPU1CS_FOVFIE                         BIT(29)                            /*!< CPU1 FPU overflow interrupt enable */
#define SYSCFG_CPU1CS_FIDIE                          BIT(30)                            /*!< CPU1 FPU input denormal interrupt enable */
#define SYSCFG_CPU1CS_FIXIE                          BIT(31)                            /*!< CPU1 FPU inexact operation interrupt enable */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

/* SYSCFG_SRAMCFG */
#define SYSCFG_SRAMCFG_TCM_WAITSTATE                 BIT(0)                             /*!< TCM(ITCM/D0TCM/D1TCM) wait-state insert bit */
#define SYSCFG_SRAMCFG_SRAM_WAITSTATE                BIT(1)                             /*!< SRAM wait-state insert bit */

