sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
/* SYSCFG_RMCFG */
#define SYSCFG_RMCFG_RM_SUBSRST_DIS                  BIT(0)                             /*!< disable recovery mode on subsystem reset */
#define SYSCFG_RMCFG_RM_SYSRST_DIS                   BIT(1)                             /*!< disable recovery mode on system reset */

/* SYSCFG_HSMSTAT */
#define SYSCFG_HSMSTAT_HSM_ENTER_STDBY               BIT(0)                             /*!< indicates that the HSM sub system has entered standby separately */

/* Timer configuration selection register*/
#define SYSCFG_TIMERCFG_TSCFG0                       BITS(0,4)                          /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG1                       BITS(5,9)                          /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG2                       BITS(10,14)                        /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG3                       BITS(16,20)                        /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG4                       BITS(21,25)                        /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG5                       BITS(26,30)                        /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG6                       BITS(0,4)                          /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG7                       BITS(5,9)                          /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG8                       BITS(10,14)                        /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG9                       BITS(16,20)                        /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG10                      BITS(21,25)                        /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG11                      BITS(26,30)                        /*!< TIMER configuration selection */
#define SYSCFG_TIMERCFG_TSCFG15                      BITS(16,20)                        /*!< TIMER configuration selection */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* SYSCFG_CPID */
#define SYSCFG_CPID_CPID                             BITS(0,31)                         /*!< ID of CPx, 43_4D_37_30h: CPx = Cortex-M7_0, 43_4D_37_31h: CPx = Cortex-M7_1 */

/* SYSCFG_CPNUM */
#define SYSCFG_CPNUM_CPNUM                           BITS(0,1)                          /*!< core number of CPx, 00: Cortex-M7_0 core0, 01: Cortex-M7_1 core 1 */

/* SYSCFG_CPCFGINF0 */
#define SYSCFG_CPCFGINF0_DC_WAY                      BITS(0,7)                          /*!< CPx level 1 data cache ways */
#define SYSCFG_CPCFGINF0_DC_SZ                       BITS(8,15)                         /*!< CPx level 1 data cache size */
#define SYSCFG_CPCFGINF0_IC_WAY                      BITS(16,23)                        /*!< CPx level 1 instruction cache ways */
#define SYSCFG_CPCFGINF0_IC_SZ                       BITS(24,31)                        /*!< CPx level 1 instruction cache size */

/* SYSCFG_CPCFGINF1 */
#define SYSCFG_CPCFGINF1_ITCM_SZ                     BITS(16,23)                        /*!< CPx instruction tightly coupled memory size */
#define SYSCFG_CPCFGINF1_DTCM_SZ                     BITS(24,31)                        /*!< CPx tightly coupled data memory size */

/* SYSCFG_CPCFGINF2 */
#define SYSCFG_CPCFGINF2_FPU                         BIT(0)                             /*!< CPx floating point unit provided bit */
#define SYSCFG_CPCFGINF2_SIMD                        BIT(1)                             /*!< CPx SIMD/NEON instruction support bit */
#define SYSCFG_CPCFGINF2_MMU                         BIT(2)                             /*!< CPx memory management unit support bit */
#define SYSCFG_CPCFGINF2_CMPU                        BIT(3)                             /*!< CPx core memory protection unit support bit */
#define SYSCFG_CPCFGINF2_CRPY                        BIT(4)                             /*!< CPx cryptography support bit */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* SYSCFG_CP0ID */
#define SYSCFG_CP0ID_CPID                            BITS(0,31)                         /*!< ID of CPx, 43_4D_37_30h: CPx = Cortex-M7_0, 43_4D_37_31h: CPx = Cortex-M7_1 */

/* SYSCFG_CP0NUM */
#define SYSCFG_CP0NUM_CPNUM                          BITS(0,1)                          /*!< core number of CPx, 00: Cortex-M7_0 core0, 01: Cortex-M7_1 core 1 */

/* SYSCFG_CP0CFGINF0 */
#define SYSCFG_CP0CFGINF0_DC_WAY                     BITS(0,7)                          /*!< CP0 level 1 data cache ways */
#define SYSCFG_CP0CFGINF0_DC_SZ                      BITS(8,15)                         /*!< CP0 level 1 data cache size */
#define SYSCFG_CP0CFGINF0_IC_WAY                     BITS(16,23)                        /*!< CP0 level 1 instruction cache ways */
#define SYSCFG_CP0CFGINF0_IC_SZ                      BITS(24,31)                        /*!< CP0 level 1 instruction cache size */

/* SYSCFG_CP0CFGINF1 */
#define SYSCFG_CP0CFGINF1_ITCM_SZ                    BITS(16,23)                        /*!< CP0 instruction tightly coupled memory size */
#define SYSCFG_CP0CFGINF1_DTCM_SZ                    BITS(24,31)                        /*!< CP0 tightly coupled data memory size */

/* SYSCFG_CP0CFGINF2 */
#define SYSCFG_CP0CFGINF2_FPU                        BIT(0)                             /*!< CP0 floating point unit provided bit */
#define SYSCFG_CP0CFGINF2_SIMD                       BIT(1)                             /*!< CP0 SIMD/NEON instruction support bit */
#define SYSCFG_CP0CFGINF2_MMU                        BIT(2)                             /*!< CP0 memory management unit support bit */
#define SYSCFG_CP0CFGINF2_CMPU                       BIT(3)                             /*!< CP0 core memory protection unit support bit */
#define SYSCFG_CP0CFGINF2_CRPY                       BIT(4)                             /*!< CP0 cryptography support bit */

