sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
#if defined (GD32A72XX) || defined (GD32A74XX)
/* SYSCFG_CP1ID */
#define SYSCFG_CP1ID_CPID                            BITS(0,31)                         /*!< ID of CPx, 43_4D_37_30h: CPx = Cortex-M7_0, 43_4D_37_31h: CPx = Cortex-M7_1 */

/* SYSCFG_CP1NUM */
#define SYSCFG_CP1NUM_CPNUM                          BITS(0,1)                          /*!< core number of CP1, 00: Cortex-M7_0 core0, 01: Cortex-M7_1 core 1 */

/* SYSCFG_CP1CFGINF0 */
#define SYSCFG_CP1CFGINF0_DC_WAY                     BITS(0,7)                          /*!< CP1 level 1 data cache ways */
#define SYSCFG_CP1CFGINF0_DC_SZ                      BITS(8,15)                         /*!< CP1 level 1 data cache size */
#define SYSCFG_CP1CFGINF0_IC_WAY                     BITS(16,23)                        /*!< CP1 level 1 instruction cache ways */
#define SYSCFG_CP1CFGINF0_IC_SZ                      BITS(24,31)                        /*!< CP1 level 1 instruction cache size */

/* SYSCFG_CP1CFGINF1 */
#define SYSCFG_CP1CFGINF1_ITCM_SZ                    BITS(16,23)                        /*!< CP1 instruction tightly coupled memory size */
#define SYSCFG_CP1CFGINF1_DTCM_SZ                    BITS(24,31)                        /*!< CP1 tightly coupled data memory size */

/* SYSCFG_CP1CFGINF2 */
#define SYSCFG_CP1CFGINF2_FPU                        BIT(0)                             /*!< CP1 floating point unit provided bit */
#define SYSCFG_CP1CFGINF2_SIMD                       BIT(1)                             /*!< CP1 SIMD/NEON instruction support bit */
#define SYSCFG_CP1CFGINF2_MMU                        BIT(2)                             /*!< CP1 memory management unit support bit */
#define SYSCFG_CP1CFGINF2_CMPU                       BIT(3)                             /*!< CP1 core memory protection unit support bit */
#define SYSCFG_CP1CFGINF2_CRPY                       BIT(4)                             /*!< CP1 cryptography support bit */

/* SYSCFG_IRCP0INTSTAT0 */
#define SYSCFG_IRCP0INTSTAT0_CP0IF                   BIT(0)                             /*!< CP0-to-CP0 INT0 interrupt status */
#define SYSCFG_IRCP0INTSTAT0_CP1IF                   BIT(1)                             /*!< CP1-to-CP0 INT0 interrupt status */

/* SYSCFG_IRCP0INTSTAT1 */
#define SYSCFG_IRCP0INTSTAT1_CP0IF                   BIT(0)                             /*!< CP0-to-CP0 INT1 interrupt status */
#define SYSCFG_IRCP0INTSTAT1_CP1IF                   BIT(1)                             /*!< CP1-to-CP0 INT1 interrupt status */

/* SYSCFG_IRCP0INTSTAT2 */
#define SYSCFG_IRCP0INTSTAT2_CP0IF                   BIT(0)                             /*!< CP0-to-CP0 INT2 interrupt status */
#define SYSCFG_IRCP0INTSTAT2_CP1IF                   BIT(1)                             /*!< CP1-to-CP0 INT2 interrupt status */

/* SYSCFG_IRCP0INTSTAT3 */
#define SYSCFG_IRCP0INTSTAT3_CP0IF                   BIT(0)                             /*!< CP0-to-CP0 INT3 interrupt status */
#define SYSCFG_IRCP0INTSTAT3_CP1IF                   BIT(1)                             /*!< CP1-to-CP0 INT3 interrupt status */

/* SYSCFG_IRCP1INTSTAT0 */
#define SYSCFG_IRCP1INTSTAT0_CP0IF                   BIT(0)                             /*!< CP0-to-CP1 INT0 interrupt status */
#define SYSCFG_IRCP1INTSTAT0_CP1IF                   BIT(1)                             /*!< CP1-to-CP1 INT0 interrupt status */

/* SYSCFG_IRCP1INTSTAT1 */
#define SYSCFG_IRCP1INTSTAT1_CP0IF                   BIT(0)                             /*!< CP0-to-CP1 INT1 interrupt status */
#define SYSCFG_IRCP1INTSTAT1_CP1IF                   BIT(1)                             /*!< CP1-to-CP1 INT1 interrupt status */

/* SYSCFG_IRCP1INTSTAT2 */
#define SYSCFG_IRCP1INTSTAT2_CP0IF                   BIT(0)                             /*!< CP0-to-CP1 INT2 interrupt status */
#define SYSCFG_IRCP1INTSTAT2_CP1IF                   BIT(1)                             /*!< CP1-to-CP1 INT2 interrupt status */

/* SYSCFG_IRCP1INTSTAT3 */
#define SYSCFG_IRCP1INTSTAT3_CP0IF                   BIT(0)                             /*!< CP0-to-CP1 INT3 interrupt status */
#define SYSCFG_IRCP1INTSTAT3_CP1IF                   BIT(1)                             /*!< CP1-to-CP1 INT3 interrupt status */

/* SYSCFG_IRCP0INT0 */
#define SYSCFG_IRCP0INT0_CPIE                        BIT(0)                             /*!< CP0 INT0 interrupt enable */

/* SYSCFG_IRCP0INT1 */
#define SYSCFG_IRCP0INT1_CPIE                        BIT(0)                             /*!< CP0 INT1 interrupt enable */

/* SYSCFG_IRCP0INT2 */
#define SYSCFG_IRCP0INT2_CPIE                        BIT(0)                             /*!< CP0 INT2 interrupt enable */

/* SYSCFG_IRCP0INT3 */
#define SYSCFG_IRCP0INT3_CPIE                        BIT(0)                             /*!< CP0 INT3 interrupt enable */

/* SYSCFG_IRCP1INT0 */
#define SYSCFG_IRCP1INT0_CPIE                        BIT(0)                             /*!< CP1 INT0 interrupt enable */

/* SYSCFG_IRCP1INT1 */
#define SYSCFG_IRCP1INT1_CPIE                        BIT(0)                             /*!< CP1 INT1 interrupt enable */

/* SYSCFG_IRCP1INT2 */
#define SYSCFG_IRCP1INT2_CPIE                        BIT(0)                             /*!< CP1 INT2 interrupt enable */

/* SYSCFG_IRCP1INT3 */
#define SYSCFG_IRCP1INT3_CPIE                        BIT(0)                             /*!< CP1 INT3 interrupt enable */

/* SYSCFG_IRCPUCTL */
#define SYSCFG_IRCPUCTL_CP0TR                        BIT(0)                             /*!< CP0 as trusted core */
#define SYSCFG_IRCPUCTL_CP1TR                        BIT(1)                             /*!< CP1 as trusted core */
#define SYSCFG_IRCPUCTL_LK                           BIT(31)                            /*!< provides a locking mechanism of the register */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

/* SYSCFG_MEMAEXCTL */
#define SYSCFG_MEMAEXCTL_SRAM0_EXDIS                 BIT(0)                             /*!< SRAM 0 controller access execution control */
#define SYSCFG_MEMAEXCTL_SRAM1_EXDIS                 BIT(1)                             /*!< SRAM 1 controller access execution control */
#define SYSCFG_MEMAEXCTL_ITCM0_DA_EXDIS              BIT(8)                             /*!< ITCM core 0 direct access execution control */
#define SYSCFG_MEMAEXCTL_ITCM1_DA_EXDIS              BIT(9)                             /*!< ITCM core 1 direct access execution control */
#define SYSCFG_MEMAEXCTL_ITCM0_BDA_EXDIS             BIT(12)                            /*!< ITCM core 0 backdoor access execution control */
#define SYSCFG_MEMAEXCTL_ITCM1_BDA_EXDIS             BIT(13)                            /*!< ITCM core 1 backdoor access execution control */
#define SYSCFG_MEMAEXCTL_DTCM0_DA_EXDIS              BIT(16)                            /*!< DTCM core 0 direct access execution control */
#define SYSCFG_MEMAEXCTL_DTCM1_DA_EXDIS              BIT(17)                            /*!< DTCM core 1 direct access execution control */
#define SYSCFG_MEMAEXCTL_DTCM0_BDA_EXDIS             BIT(20)                            /*!< DTCM core 0 backdoor access execution control */
#define SYSCFG_MEMAEXCTL_DTCM1_BDA_EXDIS             BIT(21)                            /*!< DTCM core 1 backdoor access execution control */
#define SYSCFG_MEMAEXCTL_SLKEN                       BIT(30)                            /*!< soft lock of the register */
#define SYSCFG_MEMAEXCTL_HLKEN                       BIT(31)                            /*!< hard lock of the register */

/* SYSCFG_BM1EDCEN */
#define SYSCFG_BM1EDCEN_RDC_DMA0_M_EN                BIT(0)                             /*!< enable read data check DMA0 memory accesses */
#define SYSCFG_BM1EDCEN_RDC_DMA0_P_EN                BIT(1)                             /*!< enable read data check DMA0 peripheral accesses */
#define SYSCFG_BM1EDCEN_RDC_DMA1_M_EN                BIT(2)                             /*!< enable read data check DMA1 memory accesses */
#define SYSCFG_BM1EDCEN_RDC_DMA1_P_EN                BIT(3)                             /*!< enable read data check DMA1 peripheral accesses */
#define SYSCFG_BM1EDCEN_RDC_HSM_BM1_EN               BIT(4)                             /*!< enable read data check HSM BM1 */
#define SYSCFG_BM1EDCEN_RDC_ENET_EN                  BIT(5)                             /*!< enable read data check ENET */
#define SYSCFG_BM1EDCEN_RDC_CM7_0_EN                 BIT(6)                             /*!< enable read data check Cortex-M7_0_AXIM */
#define SYSCFG_BM1EDCEN_RDC_CM7_1_EN                 BIT(8)                             /*!< enable read data check Cortex-M7_1_AXIM */
#define SYSCFG_BM1EDCEN_WDC_SRAM0_EN                 BIT(12)                            /*!< enable write data check SRAM0 */
#define SYSCFG_BM1EDCEN_ADDC_SRAM0_EN                BIT(13)                            /*!< enable address check SRAM0 */
#define SYSCFG_BM1EDCEN_WDC_SRAM1_EN                 BIT(14)                            /*!< enable write data check SRAM1 */
#define SYSCFG_BM1EDCEN_ADDC_SRAM1_EN                BIT(15)                            /*!< enable address check SRAM1 */
#define SYSCFG_BM1EDCEN_WDC_QSPI_EN                  BIT(16)                            /*!< enable write data check QSPI */
#define SYSCFG_BM1EDCEN_ADDC_QSPI_EN                 BIT(17)                            /*!< enable address check QSPI */
#define SYSCFG_BM1EDCEN_WDC_FMC_0_EN                 BIT(18)                            /*!< enable write data check FMC_0 */
#define SYSCFG_BM1EDCEN_ADDC_FMC_0_EN                BIT(19)                            /*!< enable address check FMC_0 */
#define SYSCFG_BM1EDCEN_WDC_FMC_1_EN                 BIT(20)                            /*!< enable write data check FMC_1 */
#define SYSCFG_BM1EDCEN_ADDC_FMC_1_EN                BIT(21)                            /*!< enable address check FMC_1 */
#define SYSCFG_BM1EDCEN_WDC_FMC_2_EN                 BIT(22)                            /*!< enable write data check FMC_2 */
#define SYSCFG_BM1EDCEN_ADDC_FMC_2_EN                BIT(23)                            /*!< enable address check FMC_2 */
#define SYSCFG_BM1EDCEN_WDC_TCM_EN                   BIT(24)                            /*!< enable write data check TCM */
#define SYSCFG_BM1EDCEN_ADDC_TCM_EN                  BIT(25)                            /*!< enable address check TCM */

