sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
/* SYSCFG_BM2EDCEN */
#define SYSCFG_BM2EDCEN_RDC_DMA0_M_EN                BIT(0)                             /*!< enable read data check DMA0 memory accesses */
#define SYSCFG_BM2EDCEN_RDC_DMA0_P_EN                BIT(1)                             /*!< enable read data check DMA0 peripheral accesses */
#define SYSCFG_BM2EDCEN_RDC_DMA1_M_EN                BIT(2)                             /*!< enable read data check DMA1 memory accesses */
#define SYSCFG_BM2EDCEN_RDC_DMA1_P_EN                BIT(3)                             /*!< enable read data check DMA1 peripheral accesses */
#define SYSCFG_BM2EDCEN_RDC_HSM_BM2_EN               BIT(5)                             /*!< enable read data check HSM BM2 */
#define SYSCFG_BM2EDCEN_RDC_AHBP0_EN                 BIT(7)                             /*!< enable read data check Cortex-M7_0_AHBP */
#define SYSCFG_BM2EDCEN_RDC_AHBP1_EN                 BIT(9)                             /*!< enable read data check Cortex-M7_1_AHBP */
#define SYSCFG_BM2EDCEN_WDC_APB1_EN                  BIT(20)                            /*!< enable write data check APB1 */
#define SYSCFG_BM2EDCEN_ADDC_APB1_EN                 BIT(21)                            /*!< enable address check APB1 */
#define SYSCFG_BM2EDCEN_WDC_APB2_EN                  BIT(22)                            /*!< enable write data check APB2 */
#define SYSCFG_BM2EDCEN_ADDC_APB2_EN                 BIT(23)                            /*!< enable address check APB2 */
#define SYSCFG_BM2EDCEN_WDC_AHB1_EN                  BIT(24)                            /*!< enable write data check AHB1 */
#define SYSCFG_BM2EDCEN_ADDC_AHB1_EN                 BIT(25)                            /*!< enable address check AHB1 */
#define SYSCFG_BM2EDCEN_WDC_AHB2_EN                  BIT(26)                            /*!< enable write data check AHB2 */
#define SYSCFG_BM2EDCEN_ADDC_AHB2_EN                 BIT(27)                            /*!< enable address check AHB2 */

/* SYSCFG_BUSCHKCFG */
#define SYSCFG_BUSCHKCFG_ENET_CHKEN                  BIT(1)                             /*!< enable or disable ENET mem port timeout and slaver ID check */
#define SYSCFG_BUSCHKCFG_HSM_CHKEN                   BIT(2)                             /*!< enable or disable HSM port timeout and slaver ID check */
#define SYSCFG_BUSCHKCFG_DMA0M_CHKEN                 BIT(3)                             /*!< enable or disable DMA0 mem port timeout and slaver ID check */
#define SYSCFG_BUSCHKCFG_DMA0P_CHKEN                 BIT(4)                             /*!< enable or disable DMA0 peri port timeout and slaver ID check */
#define SYSCFG_BUSCHKCFG_DMA1M_CHKEN                 BIT(5)                             /*!< enable or disable DMA1 mem port timeout and slaver ID check */
#define SYSCFG_BUSCHKCFG_DMA1P_CHKEN                 BIT(6)                             /*!< enable or disable DMA1 peri port timeout and slaver ID check */
#define SYSCFG_BUSCHKCFG_AHBP_CM7_0_CHKEN            BIT(7)                             /*!< enable or disable CM7_0 AHBP port timeout and slaver ID check */
#define SYSCFG_BUSCHKCFG_AHBP_CM7_1_CHKEN            BIT(8)                             /*!< enable or disable CM7_1 AHBP port timeout and slaver ID check */
#define SYSCFG_BUSCHKCFG_AXIM_CM7_0_CHKEN            BIT(9)                             /*!< enable or disable CM7_0 AXIM port timeout and slaver ID check */
#define SYSCFG_BUSCHKCFG_AXIM_CM7_1_CHKEN            BIT(10)                            /*!< enable or disable CM7_1 AXIM port timeout and slaver ID check */
#define SYSCFG_BUSCHKCFG_DMA0M_SPLT_WGT_CHKEN        BIT(11)                            /*!< enable or disable split0 widget of DMA0 mem redundant check */
#define SYSCFG_BUSCHKCFG_DMA0P_SPLT_WGT_CHKEN        BIT(12)                            /*!< enable or disable split0 widget of DMA0 peri redundant check */
#define SYSCFG_BUSCHKCFG_DMA1M_SPLT_WGT_CHKEN        BIT(13)                            /*!< enable or disable split0 widget of DMA1 mem redundant check */
#define SYSCFG_BUSCHKCFG_DMA1P_SPLT_WGT_CHKEN        BIT(14)                            /*!< enable or disable split0 widget of DMA1 peri redundant check */
#define SYSCFG_BUSCHKCFG_HSM_SPLT_WGT_CHKEN          BIT(15)                            /*!< enable or disable split1 widget of HSM redundant check. */
#define SYSCFG_BUSCHKCFG_TCM_SPLT_WGT_CHKEN          BIT(16)                            /*!< enable or disable split1 widget of TCM SRAM redundant check */
#define SYSCFG_BUSCHKCFG_HSM_H2H1_WGT_CHKEN          BIT(17)                            /*!< enable or disable H2H1 widget of HSM redundant check */
#define SYSCFG_BUSCHKCFG_DMA0M_H2H0_WGT_CHKEN        BIT(18)                            /*!< enable or disable H2H0 widget of DMA0 mem redundant check */
#define SYSCFG_BUSCHKCFG_DMA0P_H2H0_WGT_CHKEN        BIT(19)                            /*!< enable or disable H2H0 widget of DMA0 peri redundant check */
#define SYSCFG_BUSCHKCFG_DMA1M_H2H0_WGT_CHKEN        BIT(20)                            /*!< enable or disable H2H0 widget of DMA1 mem redundant check */
#define SYSCFG_BUSCHKCFG_DMA1P_H2H0_WGT_CHKEN        BIT(21)                            /*!< enable or disable H2H0 widget of DMA1 peri redundant check */
#define SYSCFG_BUSCHKCFG_QSPI_H2H0_WGT_CHKEN         BIT(22)                            /*!< enable or disable H2H0 widget of QSPI redundant check */
#define SYSCFG_BUSCHKCFG_TCM_H2H0_WGT_CHKEN          BIT(23)                            /*!< enable or disable H2H0 widget of TCM redundant check */
#define SYSCFG_BUSCHKCFG_ENET_WGT_CHKEN              BIT(24)                            /*!< enable or disable ENET 1:1/1:2 widget check */
#define SYSCFG_BUSCHKCFG_TCM_WGT_CHKEN               BIT(25)                            /*!< enable or disable TCM 1:1 widget check */
#define SYSCFG_BUSCHKCFG_APB1_CHKEN                  BIT(27)                            /*!< enable or disable APB1 redundant check */
#define SYSCFG_BUSCHKCFG_APB2_CHKEN                  BIT(28)                            /*!< enable or disable APB2 redundant check */
#define SYSCFG_BUSCHKCFG_AHB1_CHKEN                  BIT(29)                            /*!< enable or disable AHB1 redundant check */
#define SYSCFG_BUSCHKCFG_AHB2_CHKEN                  BIT(30)                            /*!< enable or disable AHB2 redundant check */

/* SYSCFG_TMRCS */
#define SYSCFG_TMRCS_TMRERR_FMUNMIENIE               BIT(0)                             /*!< TMR fault interrupt enable of the FMU NMI interrupt flag enable */
#define SYSCFG_TMRCS_TMRERR_CPUENIE                  BIT(1)                             /*!< TMR fault interrupt enable of the CPU released */
#define SYSCFG_TMRCS_TMRERR_MEMEXECRIE               BIT(2)                             /*!< TMR fault interrupt enable of the memory execution control register */
#define SYSCFG_TMRCS_TMRERR_CPUINTIE                 BIT(3)                             /*!< TMR fault interrupt enable of the interrupt router CPn interrupt status register */
#define SYSCFG_TMRCS_TMRERR_FMUNMIENIF               BIT(16)                            /*!< TMR fault flag of the FMU NMI interrupt flag enable */
#define SYSCFG_TMRCS_TMRERR_CPUENIF                  BIT(17)                            /*!< TMR fault flag of the CPU released register */
#define SYSCFG_TMRCS_TMRERR_MEMEXECRIF               BIT(18)                            /*!< TMR fault flag of the memory execution control register */
#define SYSCFG_TMRCS_TMRERR_CPUINTIF                 BIT(19)                            /*!< TMR fault flag of the interrupt router CPn interrupt status register */


/* constants definitions */
/* core num definitions */
#define CM7_0                                        ((uint8_t)0x00U)                   /*!< Cortex-M7 core 0 */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define CM7_1                                        ((uint8_t)0x01U)                   /*!< Cortex-M7 core 1 */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

#define CPU0_ID                                      ((uint32_t)0x434D3730U)            /*!< Cortex-M7_0 */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define CPU1_ID                                      ((uint32_t)0x434D3731U)            /*!< Cortex-M7_1 */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

