sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
#define ICACHE_INFO                                  ((uint32_t)0x00000000U)            /*!< I-Cache information */
#define DCACHE_INFO                                  ((uint32_t)0x00000001U)            /*!< D-Cache information */
#define ITCM_INFO                                    ((uint32_t)0x00000000U)            /*!< ITCM information */
#define DTCM_INFO                                    ((uint32_t)0x00000001U)            /*!< DTCM information */

/* EXTI source select definition */
#define EXTISS0                                      ((uint8_t)0x00U)                   /*!< EXTI source select register 0 */
#define EXTISS1                                      ((uint8_t)0x01U)                   /*!< EXTI source select register 1 */
#define EXTISS2                                      ((uint8_t)0x02U)                   /*!< EXTI source select register 2 */
#define EXTISS3                                      ((uint8_t)0x03U)                   /*!< EXTI source select register 3 */

/* EXTI source select mask bits definition */
#define EXTI_SS_MASK                                 BITS(0,3)                          /*!< EXTI source select mask */

/* EXTI source select jumping step definition */
#define EXTI_SS_JSTEP                                ((uint8_t)(0x04U))                 /*!< EXTI source select jumping step */

/* EXTI source select moving step definition */
#define EXTI_SS_MSTEP(pin)                           (EXTI_SS_JSTEP * ((pin) % EXTI_SS_JSTEP))   /*!< EXTI source select moving step */

/* EXTI source port definitions */
#define EXTI_SOURCE_GPIOA                            ((uint8_t)0x00U)                    /*!< EXTI GPIOA configuration */
#define EXTI_SOURCE_GPIOB                            ((uint8_t)0x01U)                    /*!< EXTI GPIOB configuration */
#define EXTI_SOURCE_GPIOC                            ((uint8_t)0x02U)                    /*!< EXTI GPIOC configuration */
#define EXTI_SOURCE_GPIOD                            ((uint8_t)0x03U)                    /*!< EXTI GPIOD configuration */
#define EXTI_SOURCE_GPIOE                            ((uint8_t)0x04U)                    /*!< EXTI GPIOE configuration */
#define EXTI_SOURCE_GPIOF                            ((uint8_t)0x05U)                    /*!< EXTI GPIOF configuration */
#define EXTI_SOURCE_GPIOG                            ((uint8_t)0x06U)                    /*!< EXTI GPIOG configuration */
#define EXTI_SOURCE_GPIOH                            ((uint8_t)0x07U)                    /*!< EXTI GPIOH configuration */
#define EXTI_SOURCE_GPIOI                            ((uint8_t)0x08U)                    /*!< EXTI GPIOI configuration */
#define EXTI_SOURCE_GPIOJ                            ((uint8_t)0x09U)                    /*!< EXTI GPIOJ configuration */
#define EXTI_SOURCE_GPIOK                            ((uint8_t)0x0AU)                    /*!< EXTI GPIOK configuration */
#define EXTI_SOURCE_GPIOL                            ((uint8_t)0x0BU)                    /*!< EXTI GPIOL configuration */
#define EXTI_SOURCE_GPIOM                            ((uint8_t)0x0CU)                    /*!< EXTI GPIOM configuration */
#define EXTI_SOURCE_GPION                            ((uint8_t)0x0DU)                    /*!< EXTI GPION configuration */

/* EXTI source pin definitions */
#define EXTI_SOURCE_PIN0                             ((uint8_t)0x00U)                    /*!< EXTI GPIO pin0 configuration */
#define EXTI_SOURCE_PIN1                             ((uint8_t)0x01U)                    /*!< EXTI GPIO pin1 configuration */
#define EXTI_SOURCE_PIN2                             ((uint8_t)0x02U)                    /*!< EXTI GPIO pin2 configuration */
#define EXTI_SOURCE_PIN3                             ((uint8_t)0x03U)                    /*!< EXTI GPIO pin3 configuration */
#define EXTI_SOURCE_PIN4                             ((uint8_t)0x04U)                    /*!< EXTI GPIO pin4 configuration */
#define EXTI_SOURCE_PIN5                             ((uint8_t)0x05U)                    /*!< EXTI GPIO pin5 configuration */
#define EXTI_SOURCE_PIN6                             ((uint8_t)0x06U)                    /*!< EXTI GPIO pin6 configuration */
#define EXTI_SOURCE_PIN7                             ((uint8_t)0x07U)                    /*!< EXTI GPIO pin7 configuration */
#define EXTI_SOURCE_PIN8                             ((uint8_t)0x08U)                    /*!< EXTI GPIO pin8 configuration */
#define EXTI_SOURCE_PIN9                             ((uint8_t)0x09U)                    /*!< EXTI GPIO pin9 configuration */
#define EXTI_SOURCE_PIN10                            ((uint8_t)0x0AU)                    /*!< EXTI GPIO pin10 configuration */
#define EXTI_SOURCE_PIN11                            ((uint8_t)0x0BU)                    /*!< EXTI GPIO pin11 configuration */
#define EXTI_SOURCE_PIN12                            ((uint8_t)0x0CU)                    /*!< EXTI GPIO pin12 configuration */
#define EXTI_SOURCE_PIN13                            ((uint8_t)0x0DU)                    /*!< EXTI GPIO pin13 configuration */
#define EXTI_SOURCE_PIN14                            ((uint8_t)0x0EU)                    /*!< EXTI GPIO pin14 configuration */
#define EXTI_SOURCE_PIN15                            ((uint8_t)0x0FU)                    /*!< EXTI GPIO pin15 configuration */

/* I2Cx fast mode plus enable */
#define SYSCFG_I2C0_FMP                              SYSCFG_PMCFG_I2C0FMPEN              /*!< I2C0 fast mode plus */
#define SYSCFG_I2C1_FMP                              SYSCFG_PMCFG_I2C1FMPEN              /*!< I2C1 fast mode plus */

/* TIMER break input source select */
#define TIMER_BRKIN_SEL_GPIO                         ((uint32_t)0x00000000U)             /*!< TIMER break input select from GPIO pin */
#define TIMER_BRKIN_SEL_TRIGSEL                      ((uint32_t)0x00000001U)             /*!< TIMER break input select from TRIGSEL */

/* TIMERx break input y */
#define TIMER63_BRKIN3_TRIG                          SYSCFG_TIMERBKINSEL_TIMER64_BRKIN3_SEL /*!< TIMER63 break input 3 selection */
#define TIMER63_BRKIN2_TRIG                          SYSCFG_TIMERBKINSEL_TIMER64_BRKIN2_SEL /*!< TIMER63 break input 2 selection */
#define TIMER63_BRKIN1_TRIG                          SYSCFG_TIMERBKINSEL_TIMER64_BRKIN1_SEL /*!< TIMER63 break input 1 selection */
#define TIMER63_BRKIN0_TRIG                          SYSCFG_TIMERBKINSEL_TIMER64_BRKIN0_SEL /*!< TIMER63 break input 0 selection */
#define TIMER62_BRKIN3_TRIG                          SYSCFG_TIMERBKINSEL_TIMER63_BRKIN3_SEL /*!< TIMER62 break input 3 selection */
#define TIMER62_BRKIN2_TRIG                          SYSCFG_TIMERBKINSEL_TIMER63_BRKIN2_SEL /*!< TIMER62 break input 2 selection */
#define TIMER62_BRKIN1_TRIG                          SYSCFG_TIMERBKINSEL_TIMER63_BRKIN1_SEL /*!< TIMER62 break input 1 selection */
#define TIMER62_BRKIN0_TRIG                          SYSCFG_TIMERBKINSEL_TIMER63_BRKIN0_SEL /*!< TIMER62 break input 0 selection */
#define TIMER61_BRKIN3_TRIG                          SYSCFG_TIMERBKINSEL_TIMER62_BRKIN3_SEL /*!< TIMER61 break input 3 selection */
#define TIMER61_BRKIN2_TRIG                          SYSCFG_TIMERBKINSEL_TIMER62_BRKIN2_SEL /*!< TIMER61 break input 2 selection */
#define TIMER61_BRKIN1_TRIG                          SYSCFG_TIMERBKINSEL_TIMER62_BRKIN1_SEL /*!< TIMER61 break input 1 selection */
#define TIMER61_BRKIN0_TRIG                          SYSCFG_TIMERBKINSEL_TIMER62_BRKIN0_SEL /*!< TIMER61 break input 0 selection */
#define TIMER60_BRKIN3_TRIG                          SYSCFG_TIMERBKINSEL_TIMER61_BRKIN3_SEL /*!< TIMER60 break input 3 selection */
#define TIMER60_BRKIN2_TRIG                          SYSCFG_TIMERBKINSEL_TIMER61_BRKIN2_SEL /*!< TIMER60 break input 2 selection */
#define TIMER60_BRKIN1_TRIG                          SYSCFG_TIMERBKINSEL_TIMER61_BRKIN1_SEL /*!< TIMER60 break input 1 selection */
#define TIMER60_BRKIN0_TRIG                          SYSCFG_TIMERBKINSEL_TIMER61_BRKIN0_SEL /*!< TIMER60 break input 0 selection */
#define TIMER20_BRKIN3_TRIG                          SYSCFG_TIMERBKINSEL_TIMER21_BRKIN3_SEL /*!< TIMER20 break input 3 selection */
#define TIMER20_BRKIN2_TRIG                          SYSCFG_TIMERBKINSEL_TIMER21_BRKIN2_SEL /*!< TIMER20 break input 2 selection */
#define TIMER20_BRKIN1_TRIG                          SYSCFG_TIMERBKINSEL_TIMER21_BRKIN1_SEL /*!< TIMER20 break input 1 selection */
#define TIMER20_BRKIN0_TRIG                          SYSCFG_TIMERBKINSEL_TIMER21_BRKIN0_SEL /*!< TIMER20 break input 0 selection */
#define TIMER19_BRKIN3_TRIG                          SYSCFG_TIMERBKINSEL_TIMER20_BRKIN3_SEL /*!< TIMER19 break input 3 selection */
#define TIMER19_BRKIN2_TRIG                          SYSCFG_TIMERBKINSEL_TIMER20_BRKIN2_SEL /*!< TIMER19 break input 2 selection */
#define TIMER19_BRKIN1_TRIG                          SYSCFG_TIMERBKINSEL_TIMER20_BRKIN1_SEL /*!< TIMER19 break input 1 selection */
#define TIMER19_BRKIN0_TRIG                          SYSCFG_TIMERBKINSEL_TIMER20_BRKIN0_SEL /*!< TIMER19 break input 0 selection */
#define TIMER7_BRKIN3_TRIG                           SYSCFG_TIMERBKINSEL_TIMER8_BRKIN3_SEL  /*!< TIMER7 break input 3 selection */
#define TIMER7_BRKIN2_TRIG                           SYSCFG_TIMERBKINSEL_TIMER8_BRKIN2_SEL  /*!< TIMER7 break input 2 selection */
#define TIMER7_BRKIN1_TRIG                           SYSCFG_TIMERBKINSEL_TIMER8_BRKIN1_SEL  /*!< TIMER7 break input 1 selection */
#define TIMER7_BRKIN0_TRIG                           SYSCFG_TIMERBKINSEL_TIMER8_BRKIN0_SEL  /*!< TIMER7 break input 0 selection */
#define TIMER0_BRKIN3_TRIG                           SYSCFG_TIMERBKINSEL_TIMER1_BRKIN3_SEL  /*!< TIMER0 break input 3 selection */
#define TIMER0_BRKIN2_TRIG                           SYSCFG_TIMERBKINSEL_TIMER1_BRKIN2_SEL  /*!< TIMER0 break input 2 selection */
#define TIMER0_BRKIN1_TRIG                           SYSCFG_TIMERBKINSEL_TIMER1_BRKIN1_SEL  /*!< TIMER0 break input 1 selection */
#define TIMER0_BRKIN0_TRIG                           SYSCFG_TIMERBKINSEL_TIMER1_BRKIN0_SEL  /*!< TIMER0 break input 0 selection */

#define CPU_HOLD                                     ((uint8_t)0x00U)                     /*!< CPU held */
#define CPU_RELEASE                                  ((uint8_t)0x01U)                     /*!< CPU released */

#define ROUND_ROBIN                                  ((uint8_t)0x00U)                     /*!< round-robin arbitration */
#define AHBS_HIGHER_PRIO                             ((uint8_t)0x01U)                     /*!< AHB slave port has higher access priority than core access */

#define RM_SYSTEM_RESET                              ((uint8_t)0x00U)                     /*!< recovery mode sequence on system reset */
#define RM_SUBSYSTEM_RESET                           ((uint8_t)0x01U)                     /*!< recovery mode sequence on subsystem reset */

/* SYSCFG flag definitions */
#define SYSCFG_FLAG_CKMNMIERR                        SYSCFG_STAT_CKMNMIIF                 /*!< HXTAL clock monitor NMI error flag */
#define SYSCFG_FLAG_NMIPINERR                        SYSCFG_STAT_NMIPINIF                 /*!< NMI pin error flag */
#define SYSCFG_FLAG_FMUNMIERR                        SYSCFG_STAT_FMUNMIIF                 /*!< FMU NMI error flag */

#define SYSCFG_FLAG_CPU0_WR_ABORT                    (SYSCFG_CPU0CS_WAS)                  /*!< CPU0 write abort on AHB slave flag */
#define SYSCFG_FLAG_CPU1_WR_ABORT                    (SYSCFG_CPU1CS_WAS | 0x01U)          /*!< CPU1 write abort on AHB slave flag */

/* SYSCFG interrupt flag constants definitions */
#define SYSCFG_INT_FLAG_CKMNMIERR                    SYSCFG_STAT_CKMNMIIF                 /*!< HXTAL clock monitor NMI error interrupt flag */
#define SYSCFG_INT_FLAG_NMIPINERR                    SYSCFG_STAT_NMIPINIF                 /*!< NMI from EXTI pin error interrupt flag */
#define SYSCFG_INT_FLAG_FMUNMIERR                    SYSCFG_STAT_FMUNMIIF                 /*!< FMU NMI error interrupt flag */

