sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
/* SYSCFG interrupt enable/disable constants definitions */
#define SYSCFG_INT_CPU0_CKMNMI                       SYSCFG_CFG_CKMNMIIE0                 /*!< NMI interrupt from EXTI enable bit of CPU0 */
#define SYSCFG_INT_CPU0_NMIPIN                       SYSCFG_CFG_NMIPINIE0                 /*!< HXTAL clock monitor NMI interrupt enable bit of CPU0 */
#define SYSCFG_INT_CPU0_FMUNMI                       SYSCFG_CFG_FMUNMIIE0                 /*!< FMU NMI interrupt enable bit of CPU0 */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define SYSCFG_INT_CPU1_CKMNMI                       SYSCFG_CFG_CKMNMIIE1                 /*!< NMI interrupt from EXTI enable bit of CPU1 */
#define SYSCFG_INT_CPU1_NMIPIN                       SYSCFG_CFG_NMIPINIE1                 /*!< HXTAL clock monitor NMI interrupt enable bit of CPU1 */
#define SYSCFG_INT_CPU1_FMUNMI                       SYSCFG_CFG_FMUNMIIE1                 /*!< FMU NMI interrupt enable bit of CPU1 */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

/* SYSCFG FPU and TCM write abort on slave overrun interrupt definitions */
#define SYSCFG_FPUINT_INEXACT                        SYSCFG_CPU0CS_FIXIE                  /*!< FPU inexact interrupt */
#define SYSCFG_FPUINT_INPUT_ABNORMAL                 SYSCFG_CPU0CS_FIDIE                  /*!< FPU input abnormal interrupt */
#define SYSCFG_FPUINT_OVERFLOW                       SYSCFG_CPU0CS_FOVFIE                 /*!< FPU overflow interrupt */
#define SYSCFG_FPUINT_UNDERFLOW                      SYSCFG_CPU0CS_FUFIE                  /*!< FPU underflow interrupt */
#define SYSCFG_FPUINT_DIV0                           SYSCFG_CPU0CS_FDZIE                  /*!< FPU divide-by-zero interrupt */
#define SYSCFG_FPUINT_INVALID_OPERATION              SYSCFG_CPU0CS_FIOPIE                 /*!< FPU invalid operation interrupt */
#define SYSCFG_TCMINT_WR_ABORT                       SYSCFG_CPU0CS_WAIE                   /*!< write abort on slave overrun interrupt */

/* SYSCFG FPU and TCM write abort on slave overrun interrupt flag definitions */
#define SYSCFG_FPUINT_FLAG_INEXACT                   SYSCFG_CPU0CS_FIXIF                  /*!< FPU inexact interrupt flag */
#define SYSCFG_FPUINT_FLAG_INPUT_ABNORMAL            SYSCFG_CPU0CS_FIDIF                  /*!< FPU input abnormal interrupt flag */
#define SYSCFG_FPUINT_FLAG_OVERFLOW                  SYSCFG_CPU0CS_FOVFIF                 /*!< FPU overflow interrupt flag */
#define SYSCFG_FPUINT_FLAG_UNDERFLOW                 SYSCFG_CPU0CS_FUFIF                  /*!< FPU underflow interrupt flag */
#define SYSCFG_FPUINT_FLAG_DIV0                      SYSCFG_CPU0CS_FDZIF                  /*!< FPU divide-by-zero interrupt flag */
#define SYSCFG_FPUINT_FLAG_INVALID_OPERATION         SYSCFG_CPU0CS_FIOPIF                 /*!< FPU invalid operation interrupt flag */
#define SYSCFG_TCMINT_FLAG_WR_ABORT                  SYSCFG_CPU0CS_WASOVF                 /*!< write abort on slave overrun interrupt flag */

/* SYSCFG core txev event output enable/disable constants definitions */
#define CORE_TX_EVENTOUT_CM7_0                       SYSCFG_CFG_CM7_0_TXEVEN              /*!< Cortex-M7 core 0(CM7_0) TX EVENTOUT */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define CORE_TX_EVENTOUT_CM7_1                       SYSCFG_CFG_CM7_1_TXEVEN              /*!< Cortex-M7 core 1(CM7_1) TX EVENTOUT */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
#define CORE_TX_EVENTOUT_CM23                        SYSCFG_CFG_CM23_TXEVEN               /*!< Cortex-M23 core(CM23 HSM) TX EVENTOUT */

#if defined (GD32A72XX) || defined (GD32A74XX)
/* interrupt router core processer interrupt interrupt definitions */
#define INTROUTER_CP_INT_0                          ((uint32_t)0x00000000U)               /*!< interrupt router core processer interrupt 0 */
#define INTROUTER_CP_INT_1                          ((uint32_t)0x00000001U)               /*!< interrupt router core processer interrupt 1 */
#define INTROUTER_CP_INT_2                          ((uint32_t)0x00000002U)               /*!< interrupt router core processer interrupt 2 */
#define INTROUTER_CP_INT_3                          ((uint32_t)0x00000003U)               /*!< interrupt router core processer interrupt 3 */

/* interrupt router core processer interrupt interrupt flag definitions */
#define INTROUTER_CP_INT_FLAG_CP0_CP0               SYSCFG_IRCP0INTSTAT0_CP0IF            /*!< CP0 to CP0 interrupt flag */
#define INTROUTER_CP_INT_FLAG_CP1_CP0               SYSCFG_IRCP0INTSTAT0_CP1IF            /*!< CP1 to CP0 interrupt flag */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

/* TMR error interrupt definitions */
#define TMRERR_INT_FMUNMI                           SYSCFG_TMRCS_TMRERR_FMUNMIENIE        /*!< TMR fault interrupt enable of the FMU NMI interrupt flag enable */
#define TMRERR_INT_CPEN                             SYSCFG_TMRCS_TMRERR_CPUENIE           /*!< TMR fault interrupt enable of the CPU released */
#define TMRERR_INT_MEMEXECR                         SYSCFG_TMRCS_TMRERR_MEMEXECRIE        /*!< TMR fault interrupt enable of the memory execution control register */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define TMRERR_INT_CPINT                            SYSCFG_TMRCS_TMRERR_CPUINTIE          /*!< TMR fault interrupt enable of the interrupt router CPn interrupt status register */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

/* TMR error interrupt definitions */
#define TMRERR_INT_FLAG_FMUNMI                      SYSCFG_TMRCS_TMRERR_FMUNMIENIF        /*!< TMR fault interrupt flag of the FMU NMI interrupt flag enable */
#define TMRERR_INT_FLAG_CPEN                        SYSCFG_TMRCS_TMRERR_CPUENIF           /*!< TMR fault interrupt flag of the CPU released */
#define TMRERR_INT_FLAG_MEMEXECR                    SYSCFG_TMRCS_TMRERR_MEMEXECRIF        /*!< TMR fault interrupt flag of the memory execution control register */
#define TMRERR_INT_FLAG_CPINT                       SYSCFG_TMRCS_TMRERR_CPUINTIF          /*!< TMR fault interrupt flag of the interrupt router CPn interrupt status register */

/* interrupt router core processor interrupt definitions */
/* CACHE status definitions */
#define CPU_CACHE_ERROR_DETECTION                   ((uint32_t)0x00000000U)               /*!< select detection information of CPU */
#define CPU_CACHE_ERROR_BANK                        ((uint32_t)0x00000001U)               /*!< select error information of CPU */

