sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
/* CACHE status information */
#define CPU0_CACHE_DETECTION                        SYSCFG_CPU0ICAC_CPU0_ICDET            /*!< CACHE error detection information of CPU0 */
#define CPU0_CACHE_ERROR                            SYSCFG_CPU0ICAC_CPU0_ICERR            /*!< CACHE error bank information of CPU0 */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define CPU1_CACHE_DETECTION                        SYSCFG_CPU1ICAC_CPU1_ICDET            /*!< CACHE error detection information of CPU1 */
#define CPU1_CACHE_ERROR                            SYSCFG_CPU1ICAC_CPU1_ICERR            /*!< CACHE error bank information of CPU1 */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

/* memory access peripheral control bit */
#define MEMAEXCTL_SRAM0                             SYSCFG_MEMAEXCTL_SRAM0_EXDIS          /*!< SRAM 0 controller access execution control */
#define MEMAEXCTL_SRAM1                             SYSCFG_MEMAEXCTL_SRAM1_EXDIS          /*!< SRAM 1 controller access execution control */
#define MEMAEXCTL_ITCM0_DA                          SYSCFG_MEMAEXCTL_ITCM0_DA_EXDIS       /*!< ITCM core 0 direct access execution control */
#define MEMAEXCTL_ITCM1_DA                          SYSCFG_MEMAEXCTL_ITCM1_DA_EXDIS       /*!< ITCM core 1 direct access execution control */
#define MEMAEXCTL_ITCM0_BDA                         SYSCFG_MEMAEXCTL_ITCM0_BDA_EXDIS      /*!< ITCM core 0 backdoor access execution control */
#define MEMAEXCTL_ITCM1_BDA                         SYSCFG_MEMAEXCTL_ITCM1_BDA_EXDIS      /*!< ITCM core 1 backdoor access execution control */
#define MEMAEXCTL_DTCM0_DA                          SYSCFG_MEMAEXCTL_DTCM0_DA_EXDIS       /*!< DTCM core 0 direct access execution control */
#define MEMAEXCTL_DTCM1_DA                          SYSCFG_MEMAEXCTL_DTCM1_DA_EXDIS       /*!< DTCM core 1 direct access execution control */
#define MEMAEXCTL_DTCM0_BDA                         SYSCFG_MEMAEXCTL_DTCM0_BDA_EXDIS      /*!< DTCM core 0 backdoor access execution control */
#define MEMAEXCTL_DTCM1_BDA                         SYSCFG_MEMAEXCTL_DTCM1_BDA_EXDIS      /*!< DTCM core 1 backdoor access execution control */

/* bus matrix definition */
#define BUS_MATRIX_1                                ((uint32_t)0x00000000U)               /*!< bus matrix 1 */
#define BUS_MATRIX_2                                BIT(31)                               /*!< bus matrix 2 */

/* bus matrix interconnect error detection */
#define BM1_RD_DATA_CHK_DMA0MEM                     ((uint32_t)(SYSCFG_BM1EDCEN_RDC_DMA0_M_EN | BUS_MATRIX_1)) /*!< read data check DMA0 memory accesses */
#define BM1_RD_DATA_CHK_DMA0PERIPH                  ((uint32_t)(SYSCFG_BM1EDCEN_RDC_DMA0_P_EN | BUS_MATRIX_1)) /*!< read data check DMA0 peripheral accesses */
#define BM1_RD_DATA_CHK_DMA1MEM                     ((uint32_t)(SYSCFG_BM1EDCEN_RDC_DMA1_M_EN | BUS_MATRIX_1)) /*!< read data check DMA1 memory accesses */
#define BM1_RD_DATA_CHK_DMA1PERIPH                  ((uint32_t)(SYSCFG_BM1EDCEN_RDC_DMA1_P_EN | BUS_MATRIX_1)) /*!< read data check DMA1 peripheral accesses */
#define BM1_RD_DATA_CHK_HSM_BM1                     ((uint32_t)(SYSCFG_BM1EDCEN_RDC_HSM_BM1_EN| BUS_MATRIX_1)) /*!< read data check HSM BM1 */
#define BM1_RD_DATA_CHK_ENET                        ((uint32_t)(SYSCFG_BM1EDCEN_RDC_ENET_EN   | BUS_MATRIX_1)) /*!< read data check ENET */
#define BM1_RD_DATA_CHK_CM7_0                       ((uint32_t)(SYSCFG_BM1EDCEN_RDC_CM7_0_EN  | BUS_MATRIX_1)) /*!< read data check Cortex-M7_0_AXIM */
#define BM1_RD_DATA_CHK_CM7_1                       ((uint32_t)(SYSCFG_BM1EDCEN_RDC_CM7_1_EN  | BUS_MATRIX_1)) /*!< read data check Cortex-M7_1_AXIM */
#define BM1_WR_DATA_CHK_SRAM0                       ((uint32_t)(SYSCFG_BM1EDCEN_WDC_SRAM0_EN  | BUS_MATRIX_1)) /*!< write data check SRAM0 */
#define BM1_ADDR_CHK_SRAM0                          ((uint32_t)(SYSCFG_BM1EDCEN_ADDC_SRAM0_EN | BUS_MATRIX_1)) /*!< address check SRAM0 */
#define BM1_WR_DATA_CHK_SRAM1                       ((uint32_t)(SYSCFG_BM1EDCEN_WDC_SRAM1_EN  | BUS_MATRIX_1)) /*!< write data check SRAM1 */
#define BM1_ADDR_CHK_SRAM1                          ((uint32_t)(SYSCFG_BM1EDCEN_ADDC_SRAM1_EN | BUS_MATRIX_1)) /*!< address check SRAM1 */
#define BM1_WR_DATA_CHK_QSPI                        ((uint32_t)(SYSCFG_BM1EDCEN_WDC_QSPI_EN   | BUS_MATRIX_1)) /*!< write data check QSPI */
#define BM1_ADDR_CHK_QSPI                           ((uint32_t)(SYSCFG_BM1EDCEN_ADDC_QSPI_EN  | BUS_MATRIX_1)) /*!< address check QSPI */
#define BM1_WR_DATA_CHK_FMC0                        ((uint32_t)(SYSCFG_BM1EDCEN_WDC_FMC_0_EN  | BUS_MATRIX_1)) /*!< write data check FMC_0 */
#define BM1_ADDR_CHK_FMC0                           ((uint32_t)(SYSCFG_BM1EDCEN_ADDC_FMC_0_EN | BUS_MATRIX_1)) /*!< address check FMC_0 */
#define BM1_WR_DATA_CHK_FMC1                        ((uint32_t)(SYSCFG_BM1EDCEN_WDC_FMC_1_EN  | BUS_MATRIX_1)) /*!< write data check FMC_1 */
#define BM1_ADDR_CHK_FMC1                           ((uint32_t)(SYSCFG_BM1EDCEN_ADDC_FMC_1_EN | BUS_MATRIX_1)) /*!< address check FMC_1 */
#define BM1_WR_DATA_CHK_FMC2                        ((uint32_t)(SYSCFG_BM1EDCEN_WDC_FMC_2_EN  | BUS_MATRIX_1)) /*!< write data check FMC_2 */
#define BM1_ADDR_CHK_FMC2                           ((uint32_t)(SYSCFG_BM1EDCEN_ADDC_FMC_2_EN | BUS_MATRIX_1)) /*!< address check FMC_2 */
#define BM1_WR_DATA_CHK_TCM                         ((uint32_t)(SYSCFG_BM1EDCEN_WDC_TCM_EN    | BUS_MATRIX_1)) /*!< write data check TCM */
#define BM1_ADDR_CHK_TCM                            ((uint32_t)(SYSCFG_BM1EDCEN_ADDC_TCM_EN   | BUS_MATRIX_1)) /*!< address check TCM */
#define BM2_RD_DATA_CHK_DMA0MEM                     ((uint32_t)(SYSCFG_BM2EDCEN_RDC_DMA0_M_EN | BUS_MATRIX_2)) /*!< read data check DMA0 memory accesses */
#define BM2_RD_DATA_CHK_DMA0PERIPH                  ((uint32_t)(SYSCFG_BM2EDCEN_RDC_DMA0_P_EN | BUS_MATRIX_2)) /*!< read data check DMA0 peripheral accesses */
#define BM2_RD_DATA_CHK_DMA1MEM                     ((uint32_t)(SYSCFG_BM2EDCEN_RDC_DMA1_M_EN | BUS_MATRIX_2)) /*!< read data check DMA1 memory accesses */
#define BM2_RD_DATA_CHK_DMA1PERIPH                  ((uint32_t)(SYSCFG_BM2EDCEN_RDC_DMA1_P_EN | BUS_MATRIX_2)) /*!< read data check DMA1 peripheral accesses */
#define BM2_RD_DATA_CHK_HSM_BM2                     ((uint32_t)(SYSCFG_BM2EDCEN_RDC_HSM_BM2_EN| BUS_MATRIX_2)) /*!< read data check HSM BM2 */
#define BM2_RD_DATA_CHK_AHBP_CM7_0                  ((uint32_t)(SYSCFG_BM2EDCEN_RDC_AHBP0_EN  | BUS_MATRIX_2)) /*!< read data check Cortex-M7_0_AHBP */
#define BM2_RD_DATA_CHK_AHBP_CM7_1                  ((uint32_t)(SYSCFG_BM2EDCEN_RDC_AHBP1_EN  | BUS_MATRIX_2)) /*!< read data check Cortex-M7_1_AHBP */
#define BM2_WR_DATA_CHK_APB1                        ((uint32_t)(SYSCFG_BM2EDCEN_WDC_APB1_EN   | BUS_MATRIX_2)) /*!< write data check APB1 */
#define BM2_ADDR_CHK_APB1                           ((uint32_t)(SYSCFG_BM2EDCEN_ADDC_APB1_EN  | BUS_MATRIX_2)) /*!< address check APB1 */
#define BM2_WR_DATA_CHK_APB2                        ((uint32_t)(SYSCFG_BM2EDCEN_WDC_APB2_EN   | BUS_MATRIX_2)) /*!< write data check APB2 */
#define BM2_ADDR_CHK_APB2                           ((uint32_t)(SYSCFG_BM2EDCEN_ADDC_APB2_EN  | BUS_MATRIX_2)) /*!< address check APB2 */
#define BM2_WR_DATA_CHK_AHB1                        ((uint32_t)(SYSCFG_BM2EDCEN_WDC_AHB1_EN   | BUS_MATRIX_2)) /*!< write data check AHB1 */
#define BM2_ADDR_CHK_AHB1                           ((uint32_t)(SYSCFG_BM2EDCEN_ADDC_AHB1_EN  | BUS_MATRIX_2)) /*!< address check AHB1 */
#define BM2_WR_DATA_CHK_AHB2                        ((uint32_t)(SYSCFG_BM2EDCEN_WDC_AHB2_EN   | BUS_MATRIX_2)) /*!< write data check AHB2 */
#define BM2_ADDR_CHK_AHB2                           ((uint32_t)(SYSCFG_BM2EDCEN_ADDC_AHB2_EN  | BUS_MATRIX_2)) /*!< address check AHB2 */

/* bus check definition */
#define ENET_MEM_PORT_CHK                           SYSCFG_BUSCHKCFG_ENET_CHKEN           /*!< ENET mem port timeout and slaver ID check, only in GD32A714Axx /A72xAxx / A74xAxx */
#define HSM_PORT_CHK                                SYSCFG_BUSCHKCFG_HSM_CHKEN            /*!< HSM port timeout and slaver ID check */
#define DMA0MEM_PORT_CHK                            SYSCFG_BUSCHKCFG_DMA0M_CHKEN          /*!< DMA0 mem port timeout and slaver ID check */
#define DMA0PERIPH_PORT_CHK                         SYSCFG_BUSCHKCFG_DMA0P_CHKEN          /*!< DMA0 peri port timeout and slaver ID check */
#define DMA1MEM_PORT_CHK                            SYSCFG_BUSCHKCFG_DMA1M_CHKEN          /*!< DMA1 mem port timeout and slaver ID check */
#define DMA1PERIPH_PORT_CHK                         SYSCFG_BUSCHKCFG_DMA1P_CHKEN          /*!< DMA1 peri port timeout and slaver ID check */
#define AHBP_CM7_0_PORT_CHK                         SYSCFG_BUSCHKCFG_AHBP_CM7_0_CHKEN     /*!< CM7_0 AHBP port timeout and slaver ID check */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define AHBP_CM7_1_PORT_CHK                         SYSCFG_BUSCHKCFG_AHBP_CM7_1_CHKEN     /*!< CM7_1 AHBP port timeout and slaver ID check */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
#define AXIM_CM7_0_PORT_CHK                         SYSCFG_BUSCHKCFG_AXIM_CM7_0_CHKEN     /*!< CM7_0 AXIM port timeout and slaver ID check */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define AXIM_CM7_1_PORT_CHK                         SYSCFG_BUSCHKCFG_AXIM_CM7_1_CHKEN     /*!< CM7_1 AXIM port timeout and slaver ID check */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
#define DMA0MEM_SPLIT0_WIDGET_CHK                   SYSCFG_BUSCHKCFG_DMA0M_SPLT_WGT_CHKEN /*!< split0 widget of DMA0 mem redundant check */
#define DMA0PERIPH_SPLIT0_WIDGET_CHK                SYSCFG_BUSCHKCFG_DMA0P_SPLT_WGT_CHKEN /*!< split0 widget of DMA0 peri redundant check */
#define DMA1MEM_SPLIT0_WIDGET_CHK                   SYSCFG_BUSCHKCFG_DMA1M_SPLT_WGT_CHKEN /*!< split0 widget of DMA1 mem redundant check */
#define DMA1PERIPH_SPLIT0_WIDGET_CHK                SYSCFG_BUSCHKCFG_DMA1P_SPLT_WGT_CHKEN /*!< split0 widget of DMA1 peri redundant check */
#define HSM_SPLIT1_WIDGET_CHK                       SYSCFG_BUSCHKCFG_HSM_SPLT_WGT_CHKEN   /*!< split1 widget of HSM redundant check */
#define TCM_SPLIT1_WIDGET_CHK                       SYSCFG_BUSCHKCFG_TCM_SPLT_WGT_CHKEN   /*!< split1 widget of TCM SRAM redundant check */
#define HSM_H2H1_WIDGET_CHK                         SYSCFG_BUSCHKCFG_HSM_H2H1_WGT_CHKEN   /*!< H2H1 widget of HSM redundant check */
#define DMA0MEM_H2H0_WIDGET_CHK                     SYSCFG_BUSCHKCFG_DMA0M_H2H0_WGT_CHKEN /*!< H2H0 widget of DMA0 mem redundant check */
#define DMA0PERIPH_H2H0_WIDGET_CHK                  SYSCFG_BUSCHKCFG_DMA0P_H2H0_WGT_CHKEN /*!< H2H0 widget of DMA0 peri redundant check */
#define DMA1MEM_H2H0_WIDGET_CHK                     SYSCFG_BUSCHKCFG_DMA1M_H2H0_WGT_CHKEN /*!< H2H0 widget of DMA1 mem redundant check */
#define DMA1PERIPH_H2H0_WIDGET_CHK                  SYSCFG_BUSCHKCFG_DMA1P_H2H0_WGT_CHKEN /*!< H2H0 widget of DMA1 peri redundant check */
#define QSPI_H2H0_WIDGET_CHK                        SYSCFG_BUSCHKCFG_QSPI_H2H0_WGT_CHKEN  /*!< H2H0 widget of QSPI redundant check */
#define TCM_H2H0_WIDGET_CHK                         SYSCFG_BUSCHKCFG_TCM_H2H0_WGT_CHKEN   /*!< H2H0 widget of TCM redundant check */
#define ENET_WIDGET_CHK                             SYSCFG_BUSCHKCFG_ENET_WGT_CHKEN       /*!< ENET 1:1/1:2 widget check, only in GD32A714Axx /A72xAxx / A74xAxx */
#define TCM_WIDGET_CHK                              SYSCFG_BUSCHKCFG_TCM_WGT_CHKEN        /*!< TCM 1:1 widget check */
#define APB1_CHK                                    SYSCFG_BUSCHKCFG_APB1_CHKEN           /*!< APB1 redundant check */
#define APB2_CHK                                    SYSCFG_BUSCHKCFG_APB2_CHKEN           /*!< APB2 redundant check */
#define AHB1_CHK                                    SYSCFG_BUSCHKCFG_AHB1_CHKEN           /*!< AHB1 redundant check */
#define AHB2_CHK                                    SYSCFG_BUSCHKCFG_AHB2_CHKEN           /*!< AHB2 redundant check */

/* timer tigger source select definition */
#define TIMER_SMCFG_TRGSEL_NONE                    ((uint8_t)0x00U)                       /*!< trigger input is none */
#define TIMER_SMCFG_TRGSEL_ITI0                    ((uint8_t)0x01U)                       /*!< internal trigger input 0 */
#define TIMER_SMCFG_TRGSEL_ITI1                    ((uint8_t)0x02U)                       /*!< internal trigger input 1 */
#define TIMER_SMCFG_TRGSEL_ITI2                    ((uint8_t)0x03U)                       /*!< internal trigger input 2 */
#define TIMER_SMCFG_TRGSEL_ITI3                    ((uint8_t)0x04U)                       /*!< internal trigger input 3 */
#define TIMER_SMCFG_TRGSEL_ITI4                    ((uint8_t)0x05U)                       /*!< internal trigger input 4 */
#define TIMER_SMCFG_TRGSEL_ITI5                    ((uint8_t)0x06U)                       /*!< internal trigger input 5 */
#define TIMER_SMCFG_TRGSEL_ITI6                    ((uint8_t)0x07U)                       /*!< internal trigger input 6 */
#define TIMER_SMCFG_TRGSEL_ITI7                    ((uint8_t)0x08U)                       /*!< internal trigger input 7 */
#define TIMER_SMCFG_TRGSEL_ITI8                    ((uint8_t)0x09U)                       /*!< internal trigger input 8 */
#define TIMER_SMCFG_TRGSEL_ITI9                    ((uint8_t)0x0AU)                       /*!< internal trigger input 9 */
#define TIMER_SMCFG_TRGSEL_CI0F_ED                 ((uint8_t)0x15U)                       /*!< TI0 edge detector */
#define TIMER_SMCFG_TRGSEL_CI0FE0                  ((uint8_t)0x16U)                       /*!< filtered TIMER input 0 */
#define TIMER_SMCFG_TRGSEL_CI1FE1                  ((uint8_t)0x17U)                       /*!< filtered TIMER input 1 */
#define TIMER_SMCFG_TRGSEL_ETIFP                   ((uint8_t)0x18U)                       /*!< external trigger */
#define TIMER_SMCFG_TRGSEL_CI2FE2                  ((uint8_t)0x19U)                       /*!< filtered TIMER input 2 */
#define TIMER_SMCFG_TRGSEL_CI3FE3                  ((uint8_t)0x1AU)                       /*!< filtered TIMER input 3 */
#define TIMER_SMCFG_TRGSEL_MCI0FEM0                ((uint8_t)0x1BU)                       /*!< filtered output of multi mode channel 0 */
#define TIMER_SMCFG_TRGSEL_MCI1FEM1                ((uint8_t)0x1CU)                       /*!< filtered output of multi mode channel 1 */
#define TIMER_SMCFG_TRGSEL_MCI2FEM2                ((uint8_t)0x1DU)                       /*!< filtered output of multi mode channel 2 */
#define TIMER_SMCFG_TRGSEL_MCI3FEM3                ((uint8_t)0x1EU)                       /*!< filtered output of multi mode channel 3 */

/* timer tigger mode select definition */
#define TIMER_QUAD_DECODER_MODE0                   ((uint8_t)0x00U)                       /*!< quadrature decoder mode 0 */
#define TIMER_QUAD_DECODER_MODE1                   ((uint8_t)0x01U)                       /*!< quadrature decoder mode 1 */
#define TIMER_QUAD_DECODER_MODE2                   ((uint8_t)0x02U)                       /*!< quadrature decoder mode 2 */
#define TIMER_SLAVE_MODE_RESTART                   ((uint8_t)0x03U)                       /*!< restart mode */
#define TIMER_SLAVE_MODE_PAUSE                     ((uint8_t)0x04U)                       /*!< pause mode */
#define TIMER_SLAVE_MODE_EVENT                     ((uint8_t)0x05U)                       /*!< event mode */
#define TIMER_SLAVE_MODE_EXTERNAL0                 ((uint8_t)0x06U)                       /*!< external clock mode 0 */
#define TIMER_SLAVE_MODE_RESTART_EVENT             ((uint8_t)0x07U)                       /*!< restart + event mode */
#define TIMER_DECODER_MODE0                        ((uint8_t)0x08U)                       /*!< decoder mode 0 */
#define TIMER_DECODER_MODE1                        ((uint8_t)0x09U)                       /*!< decoder mode 1 */
#define TIMER_DECODER_MODE2                        ((uint8_t)0x0AU)                       /*!< decoder mode 2 */
#define TIMER_DECODER_MODE3                        ((uint8_t)0x0BU)                       /*!< decoder mode 3 */
#define TIMER_SLAVE_MODE_DISABLE                   ((uint8_t)0x0FU)                       /*!< slave mode disable */

#define SYSCFG_TIMERCFG0(syscfg_timerx)            REG32(SYSCFG + 0x100U + (syscfg_timerx) * 0x0CU)/*!< TIMERx configuration register */
#define SYSCFG_TIMERCFG1(syscfg_timerx)            REG32(SYSCFG + 0x104U + (syscfg_timerx) * 0x0CU)/*!< TIMERx configuration register */
#define SYSCFG_TIMERCFG2(syscfg_timerx)            REG32(SYSCFG + 0x108U + (syscfg_timerx) * 0x0CU)/*!< TIMERx configuration register */

#define SYSCFG_TIMERCFG(syscfg_timerx)             ((uint32_t)(SYSCFG_BASE + 0x100U + (syscfg_timerx) * 0x0CU))

#define SYSCFG_TIMER0                              ((uint8_t)0x00U)                       /*!< SYSCFG TIMER0 */
#define SYSCFG_TIMER1                              ((uint8_t)0x01U)                       /*!< SYSCFG TIMER1 */
#define SYSCFG_TIMER2                              ((uint8_t)0x02U)                       /*!< SYSCFG TIMER2 */
#define SYSCFG_TIMER7                              ((uint8_t)0x03U)                       /*!< SYSCFG TIMER7 */
#define SYSCFG_TIMER19                             ((uint8_t)0x04U)                       /*!< SYSCFG TIMER19 */
#define SYSCFG_TIMER20                             ((uint8_t)0x05U)                       /*!< SYSCFG TIMER20 */
#define SYSCFG_TIMER60                             ((uint8_t)0x06U)                       /*!< SYSCFG TIMER60 */
#define SYSCFG_TIMER61                             ((uint8_t)0x07U)                       /*!< SYSCFG TIMER61 */
#define SYSCFG_TIMER62                             ((uint8_t)0x08U)                       /*!< SYSCFG TIMER62 */
#define SYSCFG_TIMER63                             ((uint8_t)0x09U)                       /*!< SYSCFG TIMER63 */

