sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
typedef enum {
    LOCKSTEP_MODE = 1U,                            /*!< the host core is in lockstep mode */
    SINGLE_CORE,                                   /*!< the host core is single core */
    DUAL_CORE,                                     /*!< the host core is dual core */
} syscfg_cpustat_enum;

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

#define NOT_EXTI_SOURCE_GPIO(exti_port)           (((exti_port) != EXTI_SOURCE_GPIOA) && ((exti_port) != EXTI_SOURCE_GPIOB) && \
                                                  ((exti_port) != EXTI_SOURCE_GPIOC) && ((exti_port) != EXTI_SOURCE_GPIOD) && \
                                                  ((exti_port) != EXTI_SOURCE_GPIOE) && ((exti_port) != EXTI_SOURCE_GPIOF) && \
                                                  ((exti_port) != EXTI_SOURCE_GPIOG) && ((exti_port) != EXTI_SOURCE_GPIOH) && \
                                                  ((exti_port) != EXTI_SOURCE_GPIOI) && ((exti_port) != EXTI_SOURCE_GPIOJ) && \
                                                  ((exti_port) != EXTI_SOURCE_GPIOK) && ((exti_port) != EXTI_SOURCE_GPIOL) && \
                                                  ((exti_port) != EXTI_SOURCE_GPIOM) && ((exti_port) != EXTI_SOURCE_GPION))

#define NOT_EXTI_SOURCE_PIN(exti_pin)             (((exti_pin) != EXTI_SOURCE_PIN0)  && ((exti_pin) != EXTI_SOURCE_PIN1) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN2)  && ((exti_pin) != EXTI_SOURCE_PIN3) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN4)  && ((exti_pin) != EXTI_SOURCE_PIN5) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN6)  && ((exti_pin) != EXTI_SOURCE_PIN7) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN8)  && ((exti_pin) != EXTI_SOURCE_PIN9) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN10) && ((exti_pin) != EXTI_SOURCE_PIN11) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN12) && ((exti_pin) != EXTI_SOURCE_PIN13) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN14) && ((exti_pin) != EXTI_SOURCE_PIN15))

#define NOT_EXTI_SOURCE_PIN_ADD(exti_pin)         (((exti_pin) != EXTI_SOURCE_PIN0)  && ((exti_pin) != EXTI_SOURCE_PIN1) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN2)  && ((exti_pin) != EXTI_SOURCE_PIN3) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN4)  && ((exti_pin) != EXTI_SOURCE_PIN5) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN6)  && ((exti_pin) != EXTI_SOURCE_PIN7) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN8)  && ((exti_pin) != EXTI_SOURCE_PIN9) && \
                                                  ((exti_pin) != EXTI_SOURCE_PIN10) && ((exti_pin) != EXTI_SOURCE_PIN11))

#define NOT_SYSCFG_I2C_FMP(i2c_fmp)               (((i2c_fmp) > 3U) || (0U == (i2c_fmp)))

#define NOT_STCM_INTERFACE_SEL(interface_sel)     (((interface_sel) != STCM_INTERFACE_JTAG) && ((interface_sel) != STCM_INTERFACE_APB))

#define NOT_CORE_TX_EVENTOUT_CM(core_txeven)      ((((core_txeven) & 0xFEFEFFFEU) != 0U) || (0U == (core_txeven)))

#define NOT_SYSCFG_TIMER_BKIN(timer_bkin)         (0U == (timer_bkin))

#define NOT_SYSCFG_TIMER_BRKIN_SEL(source_sel)    (((source_sel) != TIMER_BRKIN_SEL_GPIO)    && ((source_sel) != TIMER_BRKIN_SEL_TRIGSEL))

#if defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_CM7_NUM(core_num)                     (((core_num) != CM7_0) && ((core_num) != CM7_1))
#else 
#define NOT_CM7_NUM(core_num)                     (((core_num) != CM7_0))
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

#define NOT_CPU_HOLD_RELEASE(hold_release)        (((hold_release) != CPU_HOLD)    && ((hold_release) != CPU_RELEASE))

#define NOT_SYSCFG_PRIORITY(priority)             (((priority) != ROUND_ROBIN)      && ((priority) != AHBS_HIGHER_PRIO))

#define NOT_SYSCFG_RM_RESET(rm_reset)             (((rm_reset) != RM_SYSTEM_RESET)    && ((rm_reset) != RM_SUBSYSTEM_RESET))

#define NOT_MEMAEXCTL_PERIPH(periph_ctl)          ((((periph_ctl) & 0xFFCCCCFCU) != 0U) || (0U == (periph_ctl)))

#define NOT_BM_PERIPH(periph)                     (((periph) != BM1_RD_DATA_CHK_DMA0MEM)    && ((periph) != BM1_RD_DATA_CHK_DMA0PERIPH) && \
                                                  ((periph) != BM1_RD_DATA_CHK_DMA1MEM)    && ((periph) != BM1_RD_DATA_CHK_DMA1PERIPH) && \
                                                  ((periph) != BM1_RD_DATA_CHK_HSM_BM1)    && ((periph) != BM1_RD_DATA_CHK_ENET) && \
                                                  ((periph) != BM1_RD_DATA_CHK_CM7_0)      && ((periph) != BM1_RD_DATA_CHK_CM7_1) && \
                                                  ((periph) != BM1_WR_DATA_CHK_SRAM0)      && ((periph) != BM1_ADDR_CHK_SRAM0) && \
                                                  ((periph) != BM1_WR_DATA_CHK_SRAM1)      && ((periph) != BM1_ADDR_CHK_SRAM1) && \
                                                  ((periph) != BM1_WR_DATA_CHK_QSPI)       && ((periph) != BM1_ADDR_CHK_QSPI) && \
                                                  ((periph) != BM1_WR_DATA_CHK_FMC0)       && ((periph) != BM1_ADDR_CHK_FMC0) && \
                                                  ((periph) != BM1_WR_DATA_CHK_FMC1)       && ((periph) != BM1_ADDR_CHK_FMC1) && \
                                                  ((periph) != BM1_WR_DATA_CHK_FMC2)       && ((periph) != BM1_ADDR_CHK_FMC2) && \
                                                  ((periph) != BM1_WR_DATA_CHK_TCM)        && ((periph) != BM1_ADDR_CHK_TCM) && \
                                                  ((periph) != BM2_RD_DATA_CHK_DMA0MEM)    && ((periph) != BM2_RD_DATA_CHK_DMA0PERIPH) && \
                                                  ((periph) != BM2_RD_DATA_CHK_DMA1MEM)    && ((periph) != BM2_RD_DATA_CHK_DMA1PERIPH) && \
                                                  ((periph) != BM2_RD_DATA_CHK_HSM_BM2)    && ((periph) != BM2_RD_DATA_CHK_AHBP_CM7_0) && \
                                                  ((periph) != BM2_RD_DATA_CHK_AHBP_CM7_1) && ((periph) != BM2_WR_DATA_CHK_APB1) && \
                                                  ((periph) != BM2_ADDR_CHK_APB1)          && ((periph) != BM2_WR_DATA_CHK_APB2) && \
                                                  ((periph) != BM2_ADDR_CHK_APB2)          && ((periph) != BM2_WR_DATA_CHK_AHB1) && \
                                                  ((periph) != BM2_ADDR_CHK_AHB1)          && ((periph) != BM2_WR_DATA_CHK_AHB2) && \
                                                  ((periph) != BM2_ADDR_CHK_AHB2))

