sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
#if defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_BUS_CHK_PERIPH(periph)                ((((periph) & 0x84000001U) != 0U) || (0U == (periph)))
#elif defined (GD32A714X)
#define NOT_BUS_CHK_PERIPH(periph)                ((((periph) & 0x84000501U) != 0U) || (0U == (periph)))
#else
#define NOT_BUS_CHK_PERIPH(periph)                ((((periph) & 0x85000503U) != 0U) || (0U == (periph)))
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

#if defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_SYSCFG_INT_CPU_NMI(cpu_interrupt)     ((((cpu_interrupt) & 0xFFC7FFC7U) != 0U) || (0U == (cpu_interrupt)))
#else
#define NOT_SYSCFG_INT_CPU_NMI(cpu_interrupt)     ((((cpu_interrupt) & 0xFFC7FFFFU) != 0U) || (0U == (cpu_interrupt)))
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

#define NOT_FPU_TCM_INT(fpu_tcm_int)              ((((fpu_tcm_int) & 0x03DFFFFFU) != 0U) || (0U == (fpu_tcm_int)))

#define NOT_FPU_TCM_INTFLAG(fpu_tcm_intflag)      ((((fpu_tcm_intflag) & 0xFFFF03BFU) != 0U) || (0U == (fpu_tcm_intflag)))

#define NOT_IR_CP_INT(ir_cp_int)                  (((ir_cp_int) != INTROUTER_CP_INT_0) && ((ir_cp_int) != INTROUTER_CP_INT_1) && \
                                                  ((ir_cp_int) != INTROUTER_CP_INT_2) && ((ir_cp_int) != INTROUTER_CP_INT_3))

#if defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_TMRERR_INT(tmrerr_int)                (((tmrerr_int) != TMRERR_INT_FMUNMI)   && ((tmrerr_int) != TMRERR_INT_CPEN) && \
                                                  ((tmrerr_int) != TMRERR_INT_MEMEXECR) && ((tmrerr_int) != TMRERR_INT_CPINT))
#else
#define NOT_TMRERR_INT(tmrerr_int)                (((tmrerr_int) != TMRERR_INT_FMUNMI)   && ((tmrerr_int) != TMRERR_INT_CPEN) && \
                                                  ((tmrerr_int) != TMRERR_INT_MEMEXECR))
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

#define NOT_NMI_FLAG(nmi_flag)                    ((((nmi_flag) & 0xFFFFFFC7U) != 0U) || (0U == (nmi_flag)))

#if defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_NMI_CLEAR_FLAG(nmi_flag)              (((nmi_flag) != SYSCFG_FLAG_CKMNMIERR) && ((nmi_flag) != SYSCFG_FLAG_CPU0_WR_ABORT) && \
                                                  ((nmi_flag) != SYSCFG_FLAG_CPU1_WR_ABORT))
#else
#define NOT_NMI_CLEAR_FLAG(nmi_flag)              (((nmi_flag) != SYSCFG_FLAG_CKMNMIERR) && ((nmi_flag) != SYSCFG_FLAG_CPU0_WR_ABORT))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#define NOT_CPU_CACHE_ERROR(cache_error)          (((cache_error) != CPU_CACHE_ERROR_DETECTION) && ((cache_error) != CPU_CACHE_ERROR_BANK))

#define NOT_CACHE_INFO(cache_info)                (((cache_info) != ICACHE_INFO) && ((cache_info) != DCACHE_INFO))

#define NOT_TCM_INFO(tcm_info)                    (((tcm_info) != ITCM_INFO) && ((tcm_info) != DTCM_INFO))

#define NOT_IR_CP_INT_FLAG(int_flag)              (((int_flag) != INTROUTER_CP_INT_FLAG_CP1_CP0) && ((int_flag) != INTROUTER_CP_INT_FLAG_CP0_CP0))

#define NOT_TMRERR_INT_FLAG(tmrerr_intflag)       (((tmrerr_intflag) != TMRERR_INT_FLAG_FMUNMI)   && ((tmrerr_intflag) != TMRERR_INT_FLAG_CPEN) && \
                                                  ((tmrerr_intflag) != TMRERR_INT_FLAG_MEMEXECR) && ((tmrerr_intflag) != TMRERR_INT_FLAG_CPINT))

#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* initialization functions */
/* reset the SYSCFG registers */
void syscfg_deinit(void);

/* configure the GPIO pin as EXTI line */
void syscfg_exti_line_config(uint8_t exti_port, uint8_t exti_pin);
/* enable I2Cx(x=0,1) fast mode plus */
void syscfg_i2c_fast_mode_plus_enable(uint32_t i2c_fmp);
/* disable I2Cx(x=0,1) fast mode plus */
void syscfg_i2c_fast_mode_plus_disable(uint32_t i2c_fmp);

/* enable the tx EVENTOUT from CM_x */
void syscfg_tx_eventout_enable(uint32_t core_txeven);
/* disable the tx EVENTOUT from CM_x */
void syscfg_tx_eventout_disable(uint32_t core_txeven);

/* select TRIGSEL or GPIO as TIMER break input source */
void syscfg_timer_bkin_select(uint32_t timer_bkin, uint32_t source_sel);

/* CPU core held release set */
void syscfg_cpu_hold_release_set(uint8_t core_num, uint8_t hold_release);
/* CPU core AHB slave port priority set */
void syscfg_cpu_ahbs_priority_set(uint8_t core_num, uint8_t priority);

/* enable TCM wait state */
void syscfg_tcm_wait_state_enable(void);
/* disable TCM wait state */
void syscfg_tcm_wait_state_disable(void);
/* enable SRAM wait state */
void syscfg_sram_wait_state_enable(void);
/* disable SRAM wait state */
void syscfg_sram_wait_state_disable(void);

/* allow recovery mode on system or subsystem reset */
void syscfg_recovery_mode_allow(uint8_t rm_reset);
/* disable recovery mode on system or subsystem reset */
void syscfg_recovery_mode_disable(uint8_t rm_reset);

#if defined (GD32A72XX) || defined (GD32A74XX)
/* lock interrupt router core processor control register */
void syscfg_interrupt_router_reg_lock(void);
/* configure core processor as trusted core */
void syscfg_trusted_core_config_enable(uint8_t core_num);
/* configure core processor as non-trusted core */
void syscfg_trusted_core_config_disable(uint8_t core_num);
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
/* hard-lock the memory access execution control register */
void syscfg_mem_access_ctlreg_hard_lock(void);
/* soft-lock the memory access execution control register */
void syscfg_mem_access_ctlreg_soft_lock(void);
/* soft-unlock the memory access execution control register */
void syscfg_mem_access_ctlreg_soft_unlock(void);
/* allow memory access execution */
void syscfg_mem_access_allow(uint32_t periph_ctl);
/* disable memory access execution */
void syscfg_mem_access_disable(uint32_t periph_ctl);
/* enable peripheral bus matrix error detection function */
void syscfg_bus_matrix_error_detect_enable(uint32_t periph);
/* disable peripheral in bus matrix error detection function */
void syscfg_bus_matrix_error_detect_disable(uint32_t periph);
/* enable peripheral bus check function */
void syscfg_bus_check_enable(uint32_t periph);
/* disable peripheral bus check function */
void syscfg_bus_check_disable(uint32_t periph);

