sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.h
/* flag and interrupt functions */
/* enable the interrupt from the peripheral to the CPU NMI */
void syscfg_nmi_interrupt_enable(uint32_t cpu_interrupt);
/* disable the interrupt from the peripheral to the CPU NMI */
void syscfg_nmi_interrupt_disable(uint32_t cpu_interrupt);
/* enable FPU error and TCM write abort interrupt */
void syscfg_fpu_tcm_interrupt_enable(uint8_t core_num, uint32_t fpu_tcm_int);
/* disable FPU error and TCM write abort interrupt */
void syscfg_fpu_tcm_interrupt_disable(uint8_t core_num, uint32_t fpu_tcm_int);
#if defined (GD32A72XX) || defined (GD32A74XX)
/* enable interrupt router interrupt */
void syscfg_interrupt_router_interrupt_enable(uint8_t core_num, uint32_t ir_cp_int);
/* disable interrupt router interrupt */
void syscfg_interrupt_router_interrupt_disable(uint8_t core_num, uint32_t ir_cp_int);
#endif
/* enable TMR error interrupt */
void syscfg_tmr_error_interrupt_enable(uint32_t tmrerr_int);
/* disable TMR error interrupt */
void syscfg_tmr_error_interrupt_disable(uint32_t tmrerr_int);

/* get NMI interrupt flag */
FlagStatus syscfg_nmi_flag_get(uint32_t nmi_flag);
/* get FPU error and TCM write abort interrupt flag */
FlagStatus syscfg_fpu_tcm_interrupt_flag_get(uint8_t core_num, uint32_t fpu_tcm_intflag);
/* get CPU I-Cache error status */
uint32_t syscfg_icache_error_status_get(uint8_t core_num, uint32_t cache_error);
/* get CPU D-Cache error status */
uint32_t syscfg_dcache_error_status_get(uint8_t core_num, uint32_t cache_error);
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* get CPU platform status */
syscfg_cpustat_enum syscfg_cpu_platform_status_get(void);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
/* get HSM sub system has entered standby flag */
FlagStatus syscfg_hsm_enter_standby_flag_get(void);
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* get core processor ID */
uint32_t syscfg_cpu_id_get(void);
/* get core processor number */
uint8_t syscfg_cpu_number_get(void);
/* get CPU cache information */
uint32_t syscfg_cpu_cache_info_get(uint32_t cache_info);
/* get TCM size information */
uint32_t syscfg_cpu_tcm_size_get(uint32_t tcm_info);
/* get core processor configuration information */
uint32_t syscfg_cpu_config_info_get(void);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
/* get core 0 processor ID */
uint32_t syscfg_cpu0_id_get(void);
/* get core 0 processor number */
uint8_t syscfg_cpu0_number_get(void);
/* get CPU 0 cache information */
uint32_t syscfg_cpu0_cache_info_get(uint32_t cache_info);
/* get CPU 0 TCM size information */
uint32_t syscfg_cpu0_tcm_size_get(uint32_t tcm_info);
/* get core 0 processor configuration information */
uint32_t syscfg_cpu0_config_info_get(void);
#if defined (GD32A72XX) || defined (GD32A74XX)
/* get core 1 processor ID */
uint32_t syscfg_cpu1_id_get(void);
/* get core 1 processor number */
uint8_t syscfg_cpu1_number_get(void);
/* get CPU 1 cache information */
uint32_t syscfg_cpu1_cache_info_get(uint32_t cache_info);
/* get CPU 1 TCM size information */
uint32_t syscfg_cpu1_tcm_size_get(uint32_t tcm_info);
/* get core 1 processor configuration information */
uint32_t syscfg_cpu1_config_info_get(void);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#if defined (GD32A72XX) || defined (GD32A74XX)
/* get interrupt router interrupt flag */
FlagStatus syscfg_interrupt_router_interrupt_flag_get(uint8_t core_num, uint32_t ir_cp_int, uint32_t int_flag);
/* clear interrupt router interrupt flag */
void syscfg_interrupt_router_interrupt_flag_clear(uint8_t core_num, uint32_t ir_cp_int, uint32_t int_flag);
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
/* get TMR error interrupt flag */
FlagStatus syscfg_tmr_error_flag_get(uint32_t tmrerr_intflag);
/* clear SYSCFG CPU flag */
void syscfg_cpu_flag_clear(uint32_t nmi_flag);
/* clear TMR error interrupt flag */
void syscfg_tmr_error_int_flag_clear(uint32_t tmrerr_intflag);

#endif /* GD32A7XX_SYSCFG_H */
